[
    {"title":"Garlic Butter Edamame","summary":"Garlic Butter Edamame – healthy edamame coated with garlicky and buttery goodness. The easiest appetizer you can whip up in 10 mins | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2016/06/garlic-butter-edamame-thumb.jpg","time":"Total Time 10 minutes","ingredients":["Water for boiling","12 oz edamame","2 tablespoons salted butter","2 cloves garlic","Pinch of cayenne pepper","3 dashes ground black pepper","Pinch of kosher salt","Sesame seeds"],"instructions":["Bring a small pot of water to boil. Cook the edamame for 2-3 minutes. Drain and set aside.","Melt the salted butter by heating it up (you can heat it up in a microwave), then add the garlic, cayenne pepper and black pepper, stir to mix well.","Toss the edamame with the garlic butter mixture and top with a pinch of kosher salt and some sesame seeds. Serve immediately."]},
    {"title":"Oden Recipe","summary":"Oden is Japanese hot pot with fish balls/fish cakes. Oden is a popular winter dish. Easy oden recipe made with Mizkan (bonito flavored) soup base. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/10/oden_thumb.jpg","time":"Total Time 1 hour","ingredients":["12 oz assorted Japanese fish cakes and fish balls","4 cups water","1/4 cup Mizkan Bonito Flavored Soup Base","3 pieces kombu Japanese seaweed, cut into 1-in x 1.5-in pieces","3 hard-boiled eggs","6 oz daikon cut into wedges","4 oz konnyaku cut into pieces or wedges"],"instructions":["Rinse the fish cakes and fish balls (which are mostly fried) with running water, remove the excess oil from the fish cakes and fish balls. Drained and set aside.","In a pot, bring the water to boil and add the Mizkan (Bonito Flavored) Soup Base and the kombu, about 5 minutes.","Add the eggs, daikon, and konnyaku into the pot and boil for another 10 minutes. Add the fish balls and fish cakes into the soup and turn the heat to low. Simmer for 30 minutes and serve immediately with Japanese mustard (karashi) or shichimi togarashi."]},
    {"title":"Steamed Norwegian Salmon Recipe","summary":"Steamed Norwegian Salmon: simple, light, and healthy, with dashi stock as the base and garnish it with a fresh shiitake mushroom and a broccoli floret. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/01/steamed_salmon1.jpg","time":"","ingredients":["1/2 lb salmon cut into 2 equal-sized pieces","1 cup dashi","1 tablespoon mirin","1 tablespoon sake","1 tablespoon soy sauce","2 broccoli florets","2 fresh shiitake mushrooms"],"instructions":["Remove the scales of the salmon and clean it thoroughly. Pat dry with paper towels. Arrange the salmon, one shiitake mushroom and one broccoli floret on a deep dish.","Prepare the dashi stock by bringing to boil the dashi. Add the mirin, sake, and soy sauce. Remove from the heat and set aside.","Steam the salmon for about 3-4 minutes or until it's cooked. Discard the cloudy fish water in the dish. Pour half the dashi stock into the serving dish and serve immediately with steamed white rice.","Repeat the same for the remaining salmon and the other ingredients."]},
    {"title":"Braised Mushrooms with Dashi Recipe","summary":"Braised Mushroom with Dashi recipe - I always make this Japanese-style braised mushrooms with dashi and mirin. The end result is a very simple side dish that is absolutely umamilicious. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/03/dashi_mushrooms-1.jpg","time":"","ingredients":["1 cup dashi","1 tablespoon sake","2 tablespoons mirin","2 tablespoons soy sauce","1 teaspoon sugar","4 oz fresh shiitake mushrooms stems trimmed"],"instructions":["Add all the ingredients (except the mushroom) into a saucepan with a low to medium heat. As soon as it bubbles, add the mushrooms into the saucepan.","Cook until the dashi reduces to about half the original quantity, by then, the dashi stock would become slightly sticky because of the mushrooms. Turn off the heat, let cool. Cut the mushrooms to thin slices. This dish is best when served cold or at room temperature."]},
    {"title":"Shrimp Tempura Bento Recipe","summary":"Shrimp Tempura – A great tempura lies in the batter, which should produce crispy, airy, light, and non-greasy tempura. Try my recipe!","img":"https://rasamalaysia.com/wp-content/uploads/2012/08/shrimp-tempura-bento-thumb.jpg","time":"","ingredients":["6 shrimp or tiger prawn shelled, deveined and tail on","3 pieces Italian squash or zucchini","3 pieces sweet potato yam","3 green beans","3 pieces kabocha Japanese pumpkin","Vegetable oil for deep frying","Steamed rice","Black sesame seeds","Baby Spinach and Tofu Salad","Salmon Teriyaki","1 tablespoon Mizkan Bonito Flavored Soup Base","5 tablespoons water","1/4 tablespoon grated daikon","3 oz rice flour","1 oz all-purpose flour","1/2 tablespoon baking powder","1/4 tablespoon salt","1 tablespoon vegetable oil","1 egg yolk","150 ml ice cold water","3 small ice cubes"],"instructions":["Rinse the shrimp and pat dry with paper towels. Cut the sharp tail off with a pair of kitchen scissors. This will avoid excessive splattering while deep-frying.","To avoid the shrimp from curling, cut a few shallow vertical slits at the bottom of the shrimp.","Prepare the other vegetable ingredients and lay on a flat surface or plate.","Prepare the dipping sauce in a small bowl and set aside.","Right before you're ready to fry the tempura, mix all the ingredients of the Batter in a bowl, with a pair of chopsticks. Stir to combine well. The texture should have a runny consistency but a little lumpy is fine. Add the ice cubes in the batter.","Heat about 3 inches of oil in a flat bottom deep skillet to about 340 degree F for deep-frying. Stir the batter with a pair of chopsticks before coating the ingredients with the batter. Start off by frying the vegetables. Coat each piece of the vegetables with the batter and deep fry until light brown. Do not overcrowd the skillet so you might need to deep fry the vegetables in two batches. When the vegetables are done, transfer them out onto a dish lined with paper towels. To deep fry the shrimp, dip each shrimp in the batter and drop the shrimp into the wok, laying it flat on the skillet so the bottom part of the shrimp goes down to the skillet, which will make the lacy effect on the shrimp. Repeat the same for the other shrimp. When the shrimp turn yellowish and light golden in color and become crispy, dish out with a strainer or slotted spoon, draining the excess oil on a dish lined with paper towels.","Baby Spinach and Tofu Salad:","Ingredients:","Baby spinach","Tofu, cut into small cubes","Some shredded carrot","Mizkan Miso and Mustard Dressing","White sesame seeds","Method:","Arrange all the ingredients of the salad in the bento box. Drizzle some Mizkan Miso and Mustard Dressing on top of the salad and add the sesame seeds on top.","Assembling the Shrimp Tempura Bento:","Arrange the steamed rice in the rice compartment and top with some black sesame seeds. Next, prepared the salad according to the Salad recipe above. Place the salmon teriyaki and arrange the shrimp tempura and vegetables in the main compartment of the bento box. Add a little dipping sauce in the small compartment next to the tempura, save the remaining in a small bowl for dipping.","The bento is now done and ready to be served."]},
    {"title":"Beef Teriyaki Recipe","summary":"Beef Teriyaki - BEST and EASIEST beef teriyaki recipe that takes 15 mins to make and better than restaurants.","img":"https://rasamalaysia.com/wp-content/uploads/2014/09/teriyaki_beef-1.jpg","time":"Total Time 15 minutes","ingredients":["8 oz beef flap meat or tenderloin","Oil for pan-frying","1/2 tablespoon soy sauce","1/2 tablespoon Japanese cooking sake","Teriyaki Sauce Tare","2 tablespoons soy sauce","2 tablespoons Japanese cooking sake","2 tablespoon sugar","2 tablespoon mirin sweet rice wine","1 teaspoon cornstarch mixed with 1 teaspoon water","White sesame seeds","Some chopped scallions optional"],"instructions":["Cut the beef into strips, across the grain. Marinate the beef with the Marinade, for 5 minutes.","Mix all the ingredients in the Teriyaki Sauce. Heat up a small sauce pan and prepare the sauce. As soon as the sauce starts to bubble, remove it from the heat.","Add some oil to your skillet and pan-fry the beef, until slightly charred. Transfer the beef to a serving ware, and add the Teriyaki Sauce on top. Garnish with sesame seeds and chopped scallions, if used. Serve the beef teriyaki immediately with steamed white rice."]},
    {"title":"Japanese Ramen Eggs Recipe","summary":"How to make Ramen Eggs - gooey, soft, almost runny egg yolks, ramen eggs are the best. Learn the secret techniques.","img":"https://rasamalaysia.com/wp-content/uploads/2014/03/ramen_eggshoney_soy_wings_thumb.jpg","time":"Total Time 17 minutes","ingredients":["Water for boiling","1 tablespoon baking soda","6 eggs at room temperature","50 ml cup Japanese tsuyu or soup base such as Mizkan Bonito-Flavored Soup Base","50 ml cooking sake","25 ml soy sauce or Tamari soy sauce","25 ml mirin"],"instructions":["Combine the water and baking soda in the pot and bring the water to boil. The water level must be deep enough to cover all eggs. When the water boils, add the eggs and cook for 7 minutes.","In a separate pan add all the ingredients in Seasoning Sauce together. Bring the sauce the boil, then remove from the heat and let cool.","When your eggs are done cooking, plunge them into ice water and leave to sit for 5 minutes. Carefully peel off the shells, while the eggs are still in the water. Make sure you remove the membrane covering the egg white.","In a container or a bag, add the Seasoning Sauce and the eggs. Gently rotate the eggs to make sure they’re evenly covered in the sauce, then leave to stand overnight, or 1 or 2 days in the fridge. When they are ready to serve, slice into halves and serve with ramen or eat as a snack."]},
    {"title":"Chicken Karaage (Sesame Fried Chicken)","summary":"Chicken Karaage - crispy Japanese sesame fried chicken, the best chicken karaage recipe that is better than Japanese restaurants.","img":"https://rasamalaysia.com/wp-content/uploads/2008/10/chicken-karaage-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 pound boneless and skinless chicken breasts/thighs cut into cubes","6 tablespoons Japanese cooking sake","3 tablespoons soy sauce","3 inches fresh ginger peeled and pounded with a mortar and pestle to extract 2 tablespoons ginger juice","1 teaspoon sesame oil","Cornstarch","Oil for deep frying"],"instructions":["Use paper towels to pat dry the chicken and transfer to a bowl. Add in the sake, soy sauce, ginger juice, sesame oil and marinate for 30 minutes, best for 2 hours. Transfer the chicken pieces out of the marinate and coat them evenly with cornstarch, in a plastic bag such as Ziplock. Shake off the excess cornstarch.","Heat up a wok/pot of cooking oil. When the cooking oil is hot enough for frying (350F - 375F), drop the chicken into the oil and quickly deep fry them until they float. Transfer them out onto a plate and wait for a couple of minutes. Put the chicken back into the oil and deep-fry again until golden brown and crunchy. Dish out to a plate or bowl lined with paper towels to absorb the excess oil, serve hot with a slice of lemon and mayonnaise."]},
    {"title":"Gyudon Recipe (Japanese Beef Bowl)","summary":"Japanese Beef Bowl Gyudon - easy & delicious simmered beef with onion, soy sauce and rice. Takes 15 minutes to make | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/10/gyudon_thumb.jpg","time":"Total Time 20 minutes","ingredients":["Water for boiling","1/2 lb thinly sliced beef for sukiyaki cut into pieces","1/2 tablespoon oil","1/2 onion sliced","1 teaspoon grated ginger","1 teaspoon chopped scallion","Beni shoga","1 tablespoon Mizkan Bonito Flavored Soup Base","1 teaspoon soy sauce","1 1/2 tablespoons Mizkan Honteri Mirin","1 1/2 tablespoons sake","1 teaspoon sugar"],"instructions":["Bring a pot of water to boil. Turn off the heat and add the beef into the water, and immediately scoop them out with a strainer and set aside. DO NOT overcook the beef. Discard the water.","Mix all the ingredients in the sauce in a small bowl. Stir to combine well.","Heat a skillet on medium-high heat and add the oil. Add the onions and grated ginger and saute until the onion becomes soft. Add the beef and the Sauce into the skillet, stir to combine well. Stir the beef and onion a few times and turn off the heat.","Fill the rice bowls with steamed rice and top the simmered beef on top of the rice. Garnish with some chopped scallion and beni shoga. Serve immediately."]},
    {"title":"Seafood Dynamite Recipe","summary":"Seafood Dynamite - baby shrimp, crab meat, bay scallops, clams in a creamy mayonnaise sauce, spiked with some masago.","img":"https://rasamalaysia.com/wp-content/uploads/2010/11/seafood_dynamite-1.jpg","time":"Total Time 35 minutes","ingredients":["2 oz shelled baby shrimp","2 oz bay scallop","2 oz crab meat","2 oz shelled clam meat","4 canned button mushrooms or fresh mushrooms sliced into thin pieces","Shredded or grated cheese optional","6 tablespoons mayonnaise Japanese Kewpie mayonnaise preferred","1/2 teaspoon lime juice","1/2 teaspoon Sriracha sauce","1 teaspoon sugar","1 tablespoon masago"],"instructions":["Heat up the oven to 400 degree F.","Using a teaspoon, mix all the ingredients in the Dynamite Sauce and set aside.","Pat dry the baby shrimp, bay scallop, crab meat, clam, and sliced button mushroom with paper towels. Add half of the Dynamite Sauce to the seafood, stir to coat well.","Transfer the seafood into an oven-safe dish or container (you can also use aluminum foil or a big clam shell). Top the seafood with the remaining Dynamite Sauce. Drizzle some shredded or grated cheese on top (optional). Bake for 25-30 minutes or until the Seafood Dynamite turns slightly brown. Dish out and serve hot."]},
    {"title":"Onigiri Japanese Rice Balls Recipe","summary":"Onigiri - Easy and delicious Japanese rice balls shaped in triangles and wrapped with seaweeds. Topped with fish roes. So good | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2017/09/onigiri-japanese-rice-balls-thumb.jpg","time":"Total Time 25 minutes","ingredients":["1 cup Japanese sushi rice","1 tablespoon rice vinegar , optional","2 tablespoons Furikake bottled Japanese seasoning","Pinch of salt","Pinch of white sesame","Toasted seaweed","1 tablespoon Tobiko or fish roe"],"instructions":["Cook the rice using a rice cooker. Let cool.","Add the rice vinegar (if using), Furikake, salt and white sesame to the rice. Stir to mix well.","Using a triangle Onigiri mold or your hand, shape the rice into six (6) triangle rice balls. Wrap the bottom part of the rice balls with the seaweed. Top with the Tobiko. Serve immediately."]},
    {"title":"Hand Roll (Temaki Recipe)","summary":"Hand roll is a popular sushi. Learn how to make hand roll with this easy hand roll recipe using Mizkan sushi seasoning and rice vinegar. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2010/12/hand_roll-1.jpg","time":"","ingredients":["Sushi rice recipe here","Roasted seaweed nori sheets, cut into 5-in x 8-in pieces","1 box radish sprouts ends trimmed (2.5 oz box)","Masago for topping","4 oz shelled baby shrimps","4 oz bay scallops","6 tablespoons mayonnaise","1/2 teaspoon lime juice","1/2 teaspoon Sriracha sauce","1 teaspoon sugar","1 tablespoon masago"],"instructions":["Preheat the oven to 400 degree F.","Using a teaspoon, mix the mayonnaise, lime juice, Sriracha sauce, sugar, and masago. Set aside.","Pat dry the baby shrimps and bay scallops with paper towels. Add half of the creamy spicy sauce to the seafood, stir to coat well. Transfer the seafood into an oven-safe dish or container. Top the seafood with the remaining creamy spicy sauce. Bake for 25-30 minutes or until the top turns slightly brown. Remove from the oven and let cool.","Prepare the sushi rice per the recipe here. Let cool to room temperature.","Bake the filling per the recipe above. Once the filling is cooled to room temperature, assemble the hand roll per the step-by-step picture guide below.","Place a sheet of nori (roasted seaweed) on a flat surface. Wet your hand with some water and scoop out about 3 tablespoons of sushi rice and spread the rice evenly on the nori sheet. Leave about 1/2-inch on the sides.If you like more sushi rice in your hand roll, use 4 tablespoons of sushi rice.","Add some radish sprouts on top of the rice, follow by the Filling. Arrange them at an angle for easy rolling.","Roll up the hand roll, starting at the lower left hand corner of the nori sheet. Keep rolling to form a cone shape. Make sure you roll tightly to secure the sushi rice and fillings. Add some masago on top of the hand roll. Dip the hand roll with some soy sauce and wasabi, if you like."]},
    {"title":"Honey Miso Chicken Wings Recipe","summary":"Honey Miso Chicken Wings - sweet and savory Japanese-flavored chicken wings with miso and honey. So good you can't stop eating | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2017/03/miso-chicken-wings-thumb.jpg","time":"Total Time 40 minutes","ingredients":["1 1/2 lbs chicken wingettes and drumettes","Salt","Ground black pepper","3 cloves garlic minced","1- inch piece ginger peeled and minced","3 tablespoons white miso","3 tablespoon mirin sweet cooking wine","3 tablespoons honey","2 tablespoons soy sauce","1 tablespoon sesame oil","White sesame"],"instructions":["Preheat the oven to 400F.","Clean and rinse the chicken wings, pat with paper towels. Season with some salt and ground black pepper.","In a bowl, combine the garlic, ginger, miso, mirin, honey, soy sauce, and sesame oil together. Whisk it to form a smooth and slightly watering marinade. Marinate the chicken with the miso mixture for 2 hours.","Arrange the marinated chicken wings on a baking sheet lined with parchment paper. Shake off the excess marinade. Bake for 20 minutes or until the surface is golden brown. Turn over to the other side and bake for 10 minutes. Remove from oven, garnish with white sesame and serve immediately."]},
    {"title":"Chicken Katsu (Fried Chicken Cutlet) Recipe","summary":"Chicken Katsu is Japanese fried chicken cutlet with bread crumbs/panko. Easy chicken katsu recipe, served with Tonkatsu sauce.","img":"https://rasamalaysia.com/wp-content/uploads/2013/10/chicken_katsu_thumb.jpg","time":"Total Time 20 minutes","ingredients":["10 oz 300g boneless and skinless chicken breast","1/2 teaspoon salt","3 dashes black pepper","1 large egg lightly beaten","1 1/2 cups Japanese bread crumbs/panko","Oil for deep-frying","1 1/2 tablespoons ketchup","2 tablespoons Worcestershire sauce","1 tablespoon soy sauce","1 tablespoon mirin","1 tablespoon sugar","1/2 teaspoon Dijon mustard"],"instructions":["Slice the chicken breast horizontally into two slices. Cut each slice into 2 equal-sized pieces. Season with the salt and black pepper. Leave to stand for 10 minutes. Mix all the ingredients for the Katsu Sauce in a bowl, stir to mix well.","Heat up a pot of cooking oil for deep-frying. Ideal temperature is about 350°F/180°C.","Dip each piece of the chicken into the beaten egg, then immediately coat it with the panko. Shake off the excess. Dip the chicken into the egg again, and then coat with the panko for the second time. Make sure that the chicken is evenly coated with a thick layer of panko. Repeat the same for the other piece of chicken.","Once the oil is fully heated, gently drop each piece of the chicken into the pot and deep fry until both sides turn golden brown. Dish out the chicken onto a plate lined with paper towels. Cut the chicken into strips, and serve immediately with steamed rice and katsu sauce."]},
    {"title":"Matcha Roll Recipe","summary":"Matcha roll is a popular Japanese cake. It is a refreshing sponge cake rolled with cream and red bean filling. Easy matcha roll recipe. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/05/matcha_roll_thumb.jpg","time":"Total Time 45 minutes","ingredients":["3 egg yolks","3 egg whites","1/4 cup fine sugar","1/2 cup cake Flour plus 2tsp matcha powder","2 tablespoons butter melted","1/2 cups whipping cream","1 tablespoon sugar","Canned red bean filling available in Japanese or Asian grocery stores"],"instructions":["Whip the cream with sugar until creamy and thick. Keep in the refrigerator to chill.","Preheat oven to 230 Celsius or 440 Fahrenheit. Line and grease a 10\" x 12\" rectangle pan.","Beat the egg yolks and 1/2 the sugar until thick and pale.  In another bowl, beat the egg whites with the remaining sugar until stiff. Fold the egg yolk mixture into the egg white.","Fold in the flour mixture and melted butter. Pour the batter into the prepared pan and bake for 10 minutes.","Remove from the oven and let it cool for 10 minutes.","Transfer the cake to a piece of parchment paper. Spread an even layer of cream onto the cake and topped with red beans. Roll the cake up from the long end. Once it is firmly rolled up, wrap it up with the parchment paper and refrigerate it for at least an hour before serving."]},
    {"title":"Lobster and Mushroom Somen Recipe","summary":"Lobster and Mushroom Noodles - easy & delicious Japanese noodles with mushroom and lobster. SLURP!!! | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/06/lobster_somen_thumb.jpg","time":"Total Time 15 minutes","ingredients":["2 lobster claws","1 bundle somen","2 tablespoons Tsuyu or Soup Base such as Mizkan Bonito-Flavored Soup Base, or to taste","1 1/2 cups water","Butter","Oyster mushrooms","Green onion cut into small rings"],"instructions":["Clean and boil the lobster claws for about 5 minutes in hot boiling water, until cooked. In a separate pot, boil the somen in boiling water until it is cooked, per the package instructions, usually for 4-5 minutes.","Rinse the lobsters with cold water, crack the shells, and remove the meat. Drain the noodles and place them in an ice water bath.","Add the tsuyu or soup base to the 1 1/2 cups water, stir to mix well.","Brush the lobster meat with some butter and grill for a couple of minutes, for extra flavors and aroma. Poached lobster can taste pretty bland and grilling with butter will bring out deeper flavors and a nice aroma.","Brush the mushrooms with some butter and grill for several minutes and remove. Drain the cold noodles and place it in two serving bowls.","Pour the soup base into the bowls and add the lobster meat and grilled mushroom on top. Garnish with some chopped green onions. Serve immediately."]},
    {"title":"Gyoza Recipe (Japanese Pan-fried Dumplings)","summary":"Gyoza Recipe - Gyoza are Japanese dumplings. Learn how to make the best gyoza with this quick & easy recipe that takes only 30 minutes | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/06/gyoza-thumb.jpg","time":"Total Time 30 minutes","ingredients":["Store-bought gyoza wrapper","Oil for pan-frying","Water for steaming","8 oz ground pork","2 oz cabbage shredded and cut into small pieces","1 thumb-sized ginger peeled and grated","1 clove garlic peeled and grated","1/2 tablespoon corn starch","1 tablespoon soy sauce","1/2 tablespoon sake","3 dashes white pepper","1/2 teaspoon sesame oil","1 tablespoon chopped scallion green part only","Pinch of salt","4 tablespoons Japanese Ponzu","1/2 teaspoon sesame oil"],"instructions":["In a bowl, combine all the ingredients in the Filling and blend well. The Filling should be sticky and cohesive.","In a dipping bowl, combine the Ponzu with the sesame oil. Stir to blend well.","To assemble the gyoza, place a piece of the gyoza wrapper on your palm or a flat surface. Spoon about 1 teaspoon of the Filling onto the center of the wrapper. Dip your index finger into some water and moisten the outer edges of the dumpling wrapper. Fold the gyoza over, press and seal the left end. Use your thumb and index finger to make a pleat. Pinch to secure tightly. Repeat the same to make the pleats. (Start with 3-4 pleats if you are a beginner). A nicely wrapped gyoza should have a crescent shape.","Heat up the oil in a skillet or stir-fry pan over medium heat. Arrange the gyoza and cover with the lid. Pan-fry the gyoza until the bottoms turn golden brown and become crispy. Add about 1/4-inch water into the skillet or stir-fry pan and cover the lid immediately. The water should evaporate after a few minutes. Continue to cook the gyoza for a couple of minutes to crisp up the bottoms.","Remove the gyoza from the skillet or stir-fry pan and serve immediately with the Ponzu dipping sauce."]},
    {"title":"Fried Oysters with Panko (Kaki Furai/Kaki Fry)","summary":"Fried Oysters with Panko (Kaki Furai/Kaki Fry) recipe - Everyone loves panko, or Japanese bread crumb, that gives fried foods an airy, light, and super crispy coating.","img":"https://rasamalaysia.com/wp-content/uploads/2010/06/fried_oysters-1.jpg","time":"","ingredients":["6 raw and shucked oysters","Cornstarch","Panko Japanese bread crumbs","1 egg lightly beaten","Lemon wedges","Oil for deep frying","Mayonnaise or tonkatsu sauce for dipping"],"instructions":["Rinse the oysters thoroughly with water, pat dry with paper towels. Coat all oysters well with corn starch, follow by the beaten eggs, and finally panko. Shake off the excess panko.","Heat up a deep fryer or a pan with enough oil for deep-frying. Fry oysters until golden brown, then transfer the fried oysters out using a slotted spoon. Drain the excess oil on a plate lined with paper towels. Serve with some lemon wedges, mayonnaise or tonkatsu sauce."]},
    {"title":"Agedashi Tofu Recipe","summary":"Agedashi Tofu – a popular Japanese appetizer of deep fried tofu in a sweet and savory sauce. Super healthy, delicious and easy to make! | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2015/06/agedashi-tofu-thumb.jpg","time":"Total Time 20 minutes","ingredients":["One block soft tofu","Corn starch","Oil for deep frying","3/4 cup 185 ml dashi or Japanese fish stock","2-3 tablespoons soy sauce , or to taste","3 tablespoons sake","2 tablespoons mirin","3/4 tablespoon sugar","Peeled and grated daikon","Peeled and grated ginger optional","Sliced green onions/scallions","Dried bonito flakes/katsuobushi"],"instructions":["Cut the tofu into small pieces. Bloat each with paper towels and coat with corn starch. Set aside.","Bring all the ingredients of tentsuyu sauce to gentle simmer in a small sauce pan. Do not bring to a full boil.","Heat up the oil in a wok a frying pan and deep fry to tofu until they turn light brown or crispy. Please take note that the corn starch coating will not turn to golden brown easily. Remove the deep-fried tofu and drain the excess oil on a plate lined with paper towels.","To serve, place a few pieces of tofu in a small bowl and pour some tentsuyu sauce on the tofu. Garnish with some grated daikon, chopped scallions and dried bonito flakes. Serve immediately."]},
    {"title":"Tonkatsu Recipe","summary":"Tonkatsu - Tonkatsu is crispy and crunchy Japanese fried pork cutlet with bread crumbs or panko. Easy and the best tonkatsu recipe ever.","img":"https://rasamalaysia.com/wp-content/uploads/2011/07/tonkatsu-thumb.jpg","time":"Total Time 20 minutes","ingredients":["Oil for deep-frying","2-3 boneless pork cutlets","Salt","Ground black pepper","1/4 cup cornstarch","1 large egg beaten","1 cup Japanese panko preferred or regular breadcrumbs","Shredded cabbage","Bottled Tonkatsu sauce"],"instructions":["Heat up a small pot of oil for deep-frying, at 350F.","Rinse the pork cutlets with cold water, pat dry with paper towels and season with salt and black pepper. Arrange the cornstarch, egg and panko in three separate containers, next to each other.","Coat a piece of the pork cutlet lightly with some cornstarch. Shake off the excess. Dip the pork cutlet into the egg, then immediately onto the panko. Make sure the pork cutlet is evenly coated with a layer of panko. Set aside for deep-frying. Repeat the same to the remaining pork cutlets.","Deep fry the pork cutlets until they turn golden brown. Remove using a strainer and transfer to a plate lined with paper towels. Slice the Tonkatsu into pieces and serve immediately with some shredded cabbage and Tonkatsu sauce."]},
    {"title":"Japanese Steamed Asari Clam Recipe","summary":"Japanese Steamed Clams - Manila (Asari) clams with butter, Japanese sake and mirin. Briny, delicious and takes only 10 mins | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2008/09/japanese-steamed-clams-thumb.jpg","time":"Total Time 10 minutes","ingredients":["1 1/2 lb Manila clams","1/3 stick unsalted butter","1 1/4 cups water","1/2 cup cooking sake","1/4 cup mirin","Salt to taste","1 tablespoon chopped scallion green part only"],"instructions":["Clean the clams thoroughly and set aside. Heat up a saucepan on medium heat and add the butter. As soon as the butter melts, transfer the clams into the pan and do a few quick stirs. Add the water, sake, and mirin into the clams and cover the pan with its lid. Turn the heat to high and bring the clams to boil. As soon as all the clams are open, add in salt to taste. Dish out into a bowl, garnish with the chopped scallion, and serve immediately."]},
    {"title":"Yaki Udon Recipe","summary":"Udon noodles are popular Japanese noodles and widely eaten. You can use udon noodles to make yaki udon-fried udon noodles with veggies and meat.","img":"https://rasamalaysia.com/wp-content/uploads/2011/06/yakiudon_thumb-1.jpg","time":"Total Time 20 minutes","ingredients":["2 tablespoons oil","1/2 small onion thinly sliced","4 oz pork or chicken cut into small pieces","5 peeled and deveined shrimp","2 oz cabbage shredded","1/2 carrot peeled and cut into matchstick strips","12 oz udon","1 stalk scallion cut into 2-inch lengths","2 tablespoons Mizkan Bonito Flavor Soup Base or soy sauce","1 teaspoon Mirin","1 teaspoon Worcestershire sauce"],"instructions":["Combine all the ingredients in the Seasonings in a small bowl. Set aside.","Boil the udon per the packet instructions. Make sure not to overcook the udon. Rinse the udon with cold running water, making sure that there is no excess starch clinging to the noodles. Drain and set aside.","Heat up a wok or skillet with the oil. Add the onion and sauté briefly, follow by the pork and shrimp.","Add the cabbage, carrot, and stir a few times before adding the udon noodles. Add the Seasonings into the wok or skillet, stir continuously to combine well with all the ingredients. Add the scallions, stir a few more times, and transfer the yaki udon into a serving bowl. Top the yaki udon with some shaved bonito flakes, beni-shoga, and serve immediately."]},
    {"title":"Asari Miso Soup (Miso Soup with Clams) Recipe","summary":"Asari Miso Soup - easy Japanese miso soup with Manila clams. So briny, tasty, done in less than 15 minutes and tastes so good! | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2007/10/asari-miso-soup-thumb.jpg","time":"Total Time 15 minutes","ingredients":["3 – 4 cups water","½ block soft tofu cut into small cubes","2 oz Buna Shimeiji mushroom","½ pound Manila Clams","2 tablespoons Dashi-flavored red or white Miso paste","Chopped scallions"],"instructions":["Bring the water to boil. Add the soft tofu and mushroom. Add clams and boil for about 2 minutes or until all clams are open. Turn off the heat and add the miso (do not boil the miso) and stir it with chopsticks or a ladle until dissolved. Top with the chopped scallion and serve hot with steamed rice."]},
    {"title":"Soy Sauce Eggs (Shoyu Tamago) Recipe","summary":"Soy Sauce Eggs - easy and healthy hard-boiled eggs steeped in a soy sauce mixture. This soy sauce eggs recipe yields delicious results.","img":"https://rasamalaysia.com/wp-content/uploads/2009/12/soy-sauce-eggs-thumb.jpg","time":"Total Time 1 hour 15 minutes","ingredients":["6 hard boiled eggs","2 cups water","2 tablespoons Japanese soy sauce or tamari","1 tablespoon dark soy sauce","1 teaspoon sugar"],"instructions":["Make the hard-boiled eggs by boiling the eggs in hot water for 10 minutes. Crack and peel the shell off the eggs. Set aside.","In a small pot, bring the water to boil. Add the soy sauce, dark soy sauce and sugar. Transfer the eggs into the soy sauce mixture. Turn off the heat and let it steep in the mixture for an hour before serving."]},
    {"title":"Green Tea Rice Recipe","summary":"Green Tea Rice using green tea and regular steamed rice. Easy and healthy rice that you can have every day | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2014/07/green_tea.jpg","time":"Total Time 15 minutes","ingredients":["1 cup cooked steamed rice such as jasmine or short-grain sushi","1/4 teaspoon salt or to taste","1 cup Oi Ocha Shincha green tea","Some thinly sliced scallions","1/2 teaspoon toasted white and black sesame seeds"],"instructions":["In a small sauce pan, bring the Shincha (green tea) to simmer, add the salt and turn off the heat.","Get a large shallow bowl, put the steamed rice,  and add the scallions and sesame seeds on top of the rice. Pour the green tea over the rice and serve immediately."]},
    {"title":"Miso-Glazed Salmon Recipe","summary":"Miso-glazed broiled salmon - quick and easy recipe that takes only 15 minutes | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2014/08/miso_salmon_thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 lb skin on salmon fillets preferably about 3/4 inch thick","1/4 cup white miso","2 tablespoons mirin","1/2 teaspoon rice vinegar"],"instructions":["Preheat the oven to broil.","Mix the Miso Glaze ingredients in a small bowl and set aside.","Clean the salmon, cut into two pieces and pat dry with paper towels.","Put the salmon fillets skin side down on a foil-lined rimmed baking sheet, leaving space between them and broil for 3 minutes.","Remove the baking sheet from the oven, with a spoon, spread the miso mixture over the top of the fillets. Broil for 2 minutes or until the salmon is just barely opaque in the center."]},
    {"title":"Easy Miso Soup Recipe","summary":"Miso Soup - Japanese soup made with healthy miso paste, tofu, seaweed and dashi broth. This homemade miso soup recipe is authentic, easy and tastes better than restaurants | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2016/10/miso-soup-thumb.jpg","time":"Total Time 20 minutes","ingredients":["4 cups water","1  6-inch pieces Japanese kombu or dried kelp rinsed","1 oz dried shaved bonito flakes","1 oz dried seaweed soaked in warm water and drained","4 oz silken tofu cut into small pieces","2 1/2-3 tablespoons white miso paste","1 tablespoon chopped scallion"],"instructions":["Bring the water and kombu to boil in a stock pot on medium heat. Remove the kombu and add the bonito flakes, simmer on low heat for 5 minutes. Remove the foams and scums on the surface using a ladle.","Strain the dashi through a fine sieve. Do not squeeze or press the bonito flakes. Discard the bonito flakes. Bring the dashi to boil, then add the seaweed and tofu and cook for 3 minutes. Turn off the heat and add the miso paste into the soup. Stir the soup with a pair of chopsticks until the miso paste is completely dissolved. Top with the scallion and serve immediately."]},
    {"title":"Seared Ahi Tuna Salad with Mizkan Ponzu","summary":"Learn how to make seared ahi tuna at home, and use it to make seared ahi tuna salad. Seared ahi tuna salad with Mizkan ponzu dressing. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/11/ahi_tuna_salad_thumb.jpg","time":"","ingredients":["8 oz sushi grade ahi tuna steak","1 tablespoon Shichimi Togarashi Japanese seven spice","Olive oil for pan-searing","1 box spring mix salad 5 oz","1 tablespoon Tobikko roes","Pinch of shredded roasted seaweeds","Pinch of white sesame","1/4 cup Mizkan AJIPON® Ponzu","1/2 teaspoon honey","1/2 tablespoon sesame oil","1/2 tablespoon white sesame ground/pounded (with a mortar and pestle)"],"instructions":["Rub and season the ahi tuna steak with the Shichimi Togarashi, for 15 minutes. Heat up a pan on medium heat and add some olive oil to coat the pan. Pan-sear each side of the ahi tuna steak for about 30 seconds or as soon as the surface turns opaque. Dish out and let cool in the fridge.","Prepare the Dressing by mixing all the ingredients together.","To serve, toss the salad with the dressing and divide the salad into individual serving bowls. Slice the ahi tuna into pieces and lay them on the salad. Add some Tobikko, shredded roasted seaweed, and sesame as toppings and serve immediately."]},
    {"title":"Matcha (Green Tea) Ice Cream Recipe","summary":"Easiest Matcha (green tea) ice cream recipe that takes only 2 ingredients and you don't have to pay $3 per scoop | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2015/05/matcha-green-tea-icecream-thumb1.jpg","time":"","ingredients":["1 tub vanilla ice cream of your choice","Matcha or green tea powder to taste"],"instructions":["Leave the ice cream out for 30 minutes to thaw or until they turn slightly soft. Add in a few tablespoons of matcha (green tea) powder to get to the desired taste you want.","Stir and blend well with the ice cream. The ice cream should turn light green in color and tastes exotic with a slight tint of bitter flavor from the matcha.","Freeze the ice cream and serve cold when ready."]},
    {"title":"Salmon Teriyaki Recipe","summary":"Salmon Teriyaki - moist and juicy pan-seared salmon with teriyaki sauce. This easy salmon teriyaki recipe takes only 4 ingredients.","img":"https://rasamalaysia.com/wp-content/uploads/2016/03/salmon-teriyaki-thumb.jpg","time":"Total Time 15 minutes","ingredients":["1 lb salmon fillet","1 tablespoon oil","White and black sesame seeds for garnishing","3 tablespoons soy sauce or San-J Tamari","1/2 cup mirin","2 tablespoons sugar"],"instructions":["Add all the ingredients in the Teriyaki Sauce in a saucepan and reduce it on low heat. As soon as the teriyaki sauce thickens, remove it from heat. Let cool.","Heat up a pan or skillet over low to medium heat. Add a bit of oil and pan-sear the salmon (skin-side down) until the bottom part becomes super crispy. Cover the pan or skillet to make sure that the salmon is cooked through. Remove the salmon from heat, drizzle with the teriyaki sauce and garnish with the sesame. Serve immediately with steamed rice."]},
    {"title":"Sushi Rice Recipe","summary":"Learn how to make sushi rice with this easy sushi rice recipe. Sushi rice can be made easily with Mizkan rice vinegar or Mizkan sushi seasoning at home.","img":"https://rasamalaysia.com/wp-content/uploads/2010/12/sushi_rice-1.jpg","time":"","ingredients":["1 cup rice measured with the rice cup that comes with the rice cooker, about 80% of a regular measuring cup","1 1/2 tablespoons Mizkan Rice Vinegar","1 1/2 teaspoons sugar","1/8 teaspoon salt or to taste"],"instructions":["Cook the rice in the rice cooker. Once cooked, transfer the rice out in a bowl and add the Mizkan Rice Vinegar, sugar and salt (OR the Mizkan Sushi Seasoning) into the rice and mix well with a spoon. Let the sushi rice cool to room temperature. Use the sushi rice to make the sushi of your choice."]},
    {"title":"Teriyaki Chicken Wings Recipe","summary":"Teriyaki Chicken Wings - baked chicken wings with sticky sweet and savory teriyaki sauce. These wings are crowd pleaser and perfect for busy weeknights.","img":"https://rasamalaysia.com/wp-content/uploads/2018/01/teriyaki-chicken-wings-thumb.jpg","time":"Total Time 1 hour","ingredients":["Vegetable oil for oiling baking rack","2 pounds chicken wings flats and drumettes","2 teaspoons baking powder","2 teaspoons kosher salt","1 teaspoon black pepper","1/2 cup soy sauce","3/4 cup plus 2 tablespoons water divided","6 tablespoons honey","1 tablespoon rice vinegar","1 tablespoon mirin rice wine","1/2 teaspoon sesame oil","1 teaspoon minced ginger","1 teaspoon minced garlic","4 teaspoons cornstarch","1/4 teaspoon white sesame seeds","1 tablespoon sliced green onions"],"instructions":["Adjust oven rack to the middle position and preheat oven to 450°F. Line a large baking sheet with foil. Set a wire rack inside and coat with vegetable oil. Thoroughly dry chicken wings between paper towels.","In a large bowl whisk together baking powder, salt and pepper. Add wings to the bowl and evenly coat the surface with the baking powder mixture. Evenly space the wings on the wire rack. Bake for 20 minutes. Flip and bake for 15 minutes. Flip and bake until skin is golden brown and crisp, 15 minutes. Remove the wings from the oven and set aside.","In a medium sized saucepan whisk together soy sauce,3/4 cup water, honey, rice vinegar, mirin, sesame oil, ginger and garlic. Bring sauce to a boil over medium-high heat and cook for 1 minute. Meanwhile, in a small bowl whisk together cornstarch and 2 tablespoons water. Add cornstarch slurry into the boiling sauce, whisk to combine. Continuously stir until sauce is thickened, coating the back of a spoon, 30 to 60 seconds.","Toss wings in enough teriyaki sauce to coat, or serve sauce on the side for dipping. Serve immediately."]},
    {"title":"Japanese Beef Rolls with Ponzu","summary":"Easy Japanese beef rolls recipe with ponzu sauce. Made with Mizkan HONTERI Mirin and AJIPON Ponzu. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2010/11/beef_rolls-1.jpg","time":"","ingredients":["12 oz beef flap meat or flank steak","6 oz enoki mushrooms ends trimmed","1 teaspoon butter","Oil , for pan-searing","1/2 tablespoon white and black sesame seeds optional","1 tablespoon Mizkan (Bonito Flavored) Soup Base","1 tablespoon Mizkan HONTERI Mirin Seasoning","1 tablespoon sake","1/2 cup Mizkan AJIPON® Ponzu Citrus Seasoned Soy Sauce"],"instructions":["Slice the beef (across the grain) thinly to 3-inch by 5-inch pieces.","Marinate the beef slices with Mizkan (Bonito Flavored) Soup Base, Mizkan HONTERI Mirin Seasoning and sake for an hour.","Heat up the butter in a non-stick pan over medium heat. Add the enoki mushrooms to the pan and cook for about 1 minute or until they are just done. (Do not overcook the enoki mushrooms, they should remain somewhat crunchy.","Heat up the pan over medium heat. Grease the pan with some oil. Pan-sear the beef slices until both surfaces are slightly charred. Remove the beef from the heat.","In a serving dish, roll the beef with some enoki mushrooms and secure it with a toothpick. Drizzle some Mizkan AJIPON® Ponzu Citrus Seasoned Soy Sauce over the beef roll and topped with some sesame seeds. Serve immediately."]},
    {"title":"Shrimp Gyoza","summary":"Shrimp Gyoza - amazing Japanese gyoza dumplings filled with shrimp and cabbage. Crispy, juicy and so easy to make at home.","img":"https://rasamalaysia.com/wp-content/uploads/2016/10/shrimp-gyoza-thumb.jpg","time":"Total Time 25 minutes","ingredients":["12 oz peeled and deveined shrimp cut into small pieces","1/2 teaspoon grated ginger optional","1/2 cup shredded cabbage","1 tablespoon chopped scallion","1 teaspoon Japanese cooking sake","1 teaspoon mirin","1 teaspoon sesame oil","20 gyoza wrappers","1 tablespoons oil for pan-frying","1/2 cup water","Ponzu sauce for dipping","White sesame for garnishing","1/2  teaspoon salt"],"instructions":["Combine the shrimp, ginger (if using), cabbage, scallion, sake, mirin, salt and sesame oil in a bowl, stir and mix well to form a sticky filling.","Place a piece of gyoza wrapper on your palm and spoon about 1 heaping teaspoon of the filling onto the wrapper. Do not overfill. Dip your index finger into a small bowl of water and circle around the outer edges of the gyoza wrapper. Fold the gyoza over to form a half moon shape and pleat and pinch the folds, as pictured above. Finish by pressing the edges with your thumb and index finger to ensure that the dumpling is sealed tightly and there is no leakage. Place the gyoza on a floured surface or baking sheet.","Using a non-stick skillet (preferred) to pan-fry the shrimp gyoza. Add 1 tablespoon of oil on medium-low heat, then arrange all the gyoza on the skillet. Pan fry the gyoza until the bottom turns golden brown and crispy. Add the water and cover it with the lid. Steam the gyoza until the water completely evaporates. Serve the gyoza warm with the Ponzu sauce."]},
    {"title":"Oyakodon Recipe","summary":"One-pot Japanese chicken and eggs rice - healthy, delicious, super easy and takes only 15 minutes from prep to dining table.","img":"https://rasamalaysia.com/wp-content/uploads/2012/09/oyakodon_thumb.jpg","time":"Total Time 20 minutes","ingredients":["1/4 small onion cut into rings","8 oz chicken thigh or leg fat trimmed and cut into bite-sized pieces","3 large eggs lightly beaten","Scant 3/4 cup water","1 stalk scallion cut diagonally","2 tablespoons Mizkan Bonito Flavored Soup Base or soy sauce","1 1/2 tablespoons mirin","1 teaspoon sugar"],"instructions":["Combine all the ingredients for  the Sauce in a small bowl. Stir to combine well.","Heat up a small saucepan on high heat and bring the water to boil. Add the sliced onion, chicken, the Sauce, and cook for 2 minutes, or until the chicken is cooked. Skim off the scum.","Pour the eggs slowly in a circular motion, covering the chicken. Lower the heat to simmer and cover the saucepan with its lid. Cook for 2 minutes, or until the eggs are cooked. Add the scallions.","To serve, add steamed rice to two rice bowls and top with the simmered chicken and eggs. Serve immediately."]},
    {"title":"Sukiyaki Donburi Recipe","summary":"Sukiyaki donburi and sukiyaki donburi recipe. Easy sukiyaki donburi recipe that uses Mizkan Bonito-Flavored Soup Base, takes only 30 minutes to make. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/08/sukiyaki_donburi_thumb.jpg","time":"Total Time 30 minutes","ingredients":["8 oz shirataki noodles","6-8 shiitake mushrooms stems removed","2 oz shungiku","4-6 oz regular tofu cut into pieces","3 stalks Tokyo Negi or scallion cut diagonally into 2-inch lengths","1/2 lb thinly sliced fatty beef such as Ribeye","1/4 cup Mizkan Bonito Flavored soup base","1/4 cup water","1 teaspoon sugar","2 tablespoons Mizkan Honteri Mirin","2 tablespoons sake"],"instructions":["Rinse the shirataki noodles with cold water a few times until clean, drain and set aside. Arrange the ingredients in a skillet in the following order. Rinse the shungiku thoroughly, set aside. You can cut the bottom part of the stems, about 1/2 inch off. Make two incisions in the cap of the mushroom to form the nice \"cross\" shape. Slice the beef into smaller pieces, if you like.","Arrange the ingredients in a skillet.","Mix all the ingredients in the Sauce in a small bowl. Blend well.","Heat up the skillet on high heat. Cook for about 30 seconds, add the sauce in the skillet. Cover and cook until the sauce is boiled. Use a pair of chopsticks to turn the beef around and make sure they are cooked. Turn off the heat once everything is cooked.","Scoop steamed rice into a big rice bowl. Top the rice with the various ingredients in the Sukiyaki. Serve with some shredded benishoga (pickled ginger)."]},
    {"title":"15 Minute Soba Noodle Soup Recipe","summary":"Soba Noodle Soup - the easiest and quickest Japanese soba noodle soup ever. Takes 15 minutes and restaurant quality, so delicious!","img":"https://rasamalaysia.com/wp-content/uploads/2013/01/soba-noodle-soup-thumb.jpg","time":"Total Time 15 minutes","ingredients":["1 bundle soba noodles","1 1/2 cups water","2 tablespoons Mizkan Bonito Flavored Soup Base","1 oz buna shimeji mushroom","1 bunch baby bok choy","1 hard-boiled egg halved","White sesame","Chopped scallion"],"instructions":["Heat up a pot of water and bring it to boil. Cook the soba noodles until al dente, about 5 minutes. Drain and set aside in a bowl.","In the mean time, heat up 1 1/2 cups of water and bring it to boil. Add the Mizkan (Bonito Flavored) Soup Base and the mushroom and baby bok choy. Boil for about 1 minute or until they are cooked.","Add the egg on top of the soba noodle, then add the soup, and top with sesame and scallion."]},
    {"title":"Japanese Fried Chicken (Chicken Karaage) Bento Recipe","summary":"Japanese Fried Chicken Bento with steamed rice and sesame seeds, pickled cucumbers, salad and Gyoza. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/07/karaage_bento_thumb.jpg","time":"Total Time 20 minutes","ingredients":["8 oz skinless and boneless chicken chicken breast or thigh (preferred)","1 tablespoon ginger juice extracted from 2-inch piece ginger","1 1/2 tablespoons Mizkan Bonito Flavored Soup Base","1 tablespoon Mizkan HONTERI® Mirin","3/4 cup cornstarch or potato starch","Oil for deep-frying","Steamed rice","Sesame seeds","Cucumer Pickle","Salad","Gyoza","4 oz cucumber","1/2 teaspoon salt","1 teaspoon sugar","1 teaspoon Mizkan Rice Vinegar","Mixed green or fresh herb salad","Mizkan Sesame Dressing"],"instructions":["Cut the chicken into bite-sized pieces/cubes. Use paper towels to pat dry the chicken and transfer to a bowl. Grate the ginger and extract the juice by squeezing with your hand, you should get about 1 tablespoon ginger juice.","Add the Mizkan (Bonito Flavored) Soup Base, Mizkan HONTERI® Mirin, and ginger juice to the chicken and marinate for 30 minutes. Transfer the chicken out of the marinade and coat them evenly with the corn starch or potato starch. Shake off the excess.","Heat 2 to 3 inches of oil in a pan or small stockpot to 350 degree F for deep-frying. Gently drop the chicken pieces into the oil and deep-fry until golden brown. Dish out with a strainer or slotted spoon, draining the excess oil by laying the chicken on a dish lined with paper towels.","Cut the cucumber lengthwise and then slice into small pieces. Transfer the cucumber to a small bowl and add the salt, sugar, Mizkan Rice Vinegar and mix well. Chill in the refrigerator for 30 minutes.","Arrange the salad in the salad compartment of the bento box. Drizzle some Mizkan Sesame Dressing on top of the salad.","Lay a piece of lettuce leaf on the main dish compartment. Arrange the fried chicken on top of it.","Add a bowl of steamed rice in the rice compartment and top with some black sesame seeds.","Add 3-4 gyoza in the side dish compartment.","Add the chilled cucumber pickle in the tsukemono compartment.","The bento is now done and ready to be served."]},
    {"title":"Yakisoba (Japanese Fried Noodles) Recipe","summary":"Yakisoba or Japanese fried noodles is a popular dish. Inspired by Chinese fried noodles, this yakisoba recipe is made with cabbage, carrot, and pork | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/yakisoba.jpg","time":"Total Time 25 minutes","ingredients":["12 oz. yakisoba rinsed with water and drained","3 cloves garlic finely chopped","2 oz. pork cut into small pieces and marinated with some soy sauce","2 oz. cabbage roughly chopped into pieces","2 oz. carrot cut into thin strips","Some scallions cut into thin threads","2 tablespoons oil","2 tablespoons soy sauce","1 tablespoon sake","1/2 teaspoon mirin","3 dashes white pepper powder","1/2 teaspoon sugar","1/8 teaspoon sesame oil","Salt to taste"],"instructions":["Heat up wok with oil. Add garlic and stir fry until light brown in color. Add pork and do a few quick stirs before adding cabbage and carrot. Stir a few times and add noodles and all the seasonings. Continue to stir-fry until the vegetables and noodles are cooked, for 1-2 minutes. Transfer out and serve immediately with some benishoga (Japanese picked ginger)."]},
    {"title":"Dynamite Shrimp Recipe","summary":"Dynamite Shrimp, crispy shrimp coated with rich creamy Sriracha mayo just like your favorite Japanese restaurant. Super delicious but very easy to make at home | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/03/shrimp_dynamite_thumb-1.jpg","time":"Total Time 20 minutes","ingredients":["6 oz shelled and deveined medium-sized shrimp","Oil for deep-frying","1/4 cup all-purpose flour sifted","1/4 cup cornstarch","1/2 teaspoon baking powder","1 egg white","50 ml water","1 tablespoon oil","Pinch of salt","3 tablespoons mayonnaise Kewpie brand preferred","1 teaspoon honey","Scant 1/4 teaspoon Sriracha or to taste","A squirt lemon juice"],"instructions":["Clean and rinse the shrimp with cold running water. Pat dry with paper towels and set aside.","Prepare the Batter by mixing all the ingredients together. Prepare the Dressing by combining all the ingredients together.","Add the shrimp into the batter and coat evenly. Heat up a deep-fryer or a pot with oil for deep-frying. When the oil is heated, drop each shrimp gently into the oil and deep fry until they turn golden brown. Transfer them out with a slotted spoon and transfer to a bowl lined with paper towels.","Remove the paper towels and add the Dressing into the bowl and toss it around until all the shrimp are nicely coated with the dressing. Serve immediately."]},
    {"title":"Japanese Meat and Potato Stew (Nikujaga) Recipe","summary":"Japanese Meat and Potato Stew (Nikujaga) – hearty stew with meat and potatoes. This Japanese comfort food is delicious for colder months | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2016/12/nikujaga-japanese-beef-potato-stew-thumb.jpg","time":"Total Time 30 minutes","ingredients":["1 tablespoon oil","2 oz onion quartered","8 oz thinly sliced pork or beef","2 oz carrots","6 oz potatoes cut into pieces","2 cups water or dashi preferred","2 tablespoons soy sauce","2 tablespoons cooking sake","2 tablespoons mirin Japanese sweet wine seasoning","2 teaspoons sugar","4 oz Shirataki noodles or Konnyaku noodles optional","Salt to taste","1 stalk scallion cut into 2-inch strips"],"instructions":["Heat up a small soup pot on medium heat and add the oil. When the oil is heated, add the onion, stirring a few times before adding the meat. Stirring and cooking, then add the carrots and potatoes. Stir to combine well with the meat.","Add the water and bring it to boil. Add the soy sauce, sake, mirin and sugar. Lower the heat, cover the pot and simmer until the carrots and potatoes are cooked through and the sauce reduces. Add the Shirataki noodles, cook for 1 minute. Add salt and the scallions. Turn off heat and serve immediately."]},
    {"title":"Flank Steak with Ponzu and Miso Butter","summary":"Flank Steak with Miso Butter – the most tender, juiciest, and delicious flank steak ever. Make it at home with this easy recipe | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/07/flank_steak_thumb.jpg","time":"","ingredients":["2 lbs flank steak cut into four 8-oz piece","Ponzu and Miso Butter Glaze","3/4 cup Yields","1 tablespoon Mizkan AJIPON® Ponzu","2 tablespoons MIZKAN HONTERI® Mirin Seasoning","3 tablespoons Shiro miso white miso","4 tablespoons or 1/2 stick butter, melted","2 tablespoons Japanese cooking sake","2 teaspoons sugar","1/8 teaspoon cayenne pepper","3 dashes black pepper","Fresh herb salad","3 tablespoons Mizkan AJIPON® Ponzu"],"instructions":["Mix all the ingredients for the Ponzu and Miso Butter Glaze in a sauce pan. Bring it to boil and remove from the heat immediately. Let cool.","In a plastic bag, marinate the steak for 1 hour with half of the glaze. Fire up the grill, scrape off the excess glaze and then grill. If the grill flares up, move the steak to the cooler spot to prevent burning. Return the steak to the heat when the flame dies down.","Grill each side for about 3-4 minutes, then gently pick it up with a pair of tongs and grill the other side for another 3-4 minutes, or until the surface becomes nicely charred or to your desired doneness. Brush some glaze on the surface of the meat and let set on the grill for another 1 minute on each side.","Remove the steak from the grill and let rest for 10 minutes.","This will allow the juice inside the steak to redistribute so it will not leak out when you slice it. (A tip from Harry Soo, BBQ expert)","While the steak is resting, toss the fresh herb salad with Mizkan AJIPON® Ponzu.","On a serving plate, place about 1 tablespoon of the Ponzu and Miso Butter glaze on the plate. Place the steak on top of the glaze. Drizzle a little more glaze on top, and serve with some fresh herb salad."]},
    {"title":"Yakitori Recipe","summary":"Yakitori - Yakitori is Japanese grilled chicken skewers. Learn how to make them with this easy Yakitori recipe that takes only 20 mins | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2010/05/yakitori-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 lb boneless and skinless chicken leg meat cut into bite-size pieces","Scallions white part only, cut into 2-in lengths","Bamboo skewers soaked before grilling","Sea salt","3 tablespoons soy sauce","1/2 cup mirin","2 tablespoons sugar"],"instructions":["Add all the ingredients of the Tare Sauce into a small sauce pan and bring it to boil. Transfer out to a small bowl and set aside.","Thread 3 pieces of chicken meat onto a bamboo skewer, separating each piece with the scallion.","Heat up a BBQ grill and sprinkle a wee bit of salt sparingly on the surface of the chicken. Turn the skewers and do the same on the other side. Keep turning the chicken to make sure they are cooked and charred evenly. When the chicken is almost done, dip the chicken skewer into the tare sauce and grill it for about 30-40 seconds on both sides. Serve immediately."]},
    {"title":"California Roll Recipe","summary":"California Roll - easy homemade California roll. Learn how to make this popular sushi with the step-by-step picture guide | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2016/05/california-rolls-thumb.jpg","time":"Total Time 1 hour","ingredients":["1 cup sushi rice Japanese short-grain rice","1 1/2 cups water","1 tablespoon Japanese rice vinegar","1/2 tablespoon sugar","Scant 1/4 teaspoon salt","Toasted white sesame","3 oz Louis Kemp Crab Delights® Flake Style","2 tablespoons mayonnaise","Squirt of lemon juice","1 small cucumber seeded and cut into 3.5-inch strips","1 avocado peeled and cut into strips","Soy sauce","Wasabi","Pickled sushi ginger"],"instructions":["Rinse the sushi rice with cold water until the water becomes clear. Discard all the cloudy water and add 1 1/2 cups clean water to the rice. Cook the sushi rice in an electronic rice cooker. After the rice is cooked, scoop the rice out onto a plate, let cool.","Mix the rice vinegar, sugar and salt together in a small bowl. Make sure the sugar is dissolved. Add the vinegar mixture to the rice, stir evenly. Set the sushi rice aside.","Chop the Crab Delights and mix with mayonnaise and lemon juice. Stir to combine well.","Lay the bamboo mat on a flat surface and cover it with plastic wrap. Lay a small sheet of nori (3.75 inch x 8 inch) on the bottom part. Using a spoon, scoop the rice onto the seaweed and distribute it evenly in a thin layer. Use the back of the spoon to press and flatten the surface of the rice. Sprinkle some toasted sesame seeds on top of the rice and use the back of the spoon to press the sesame onto the rice.","Turn the seaweed over. Arrange 4 strips of cucumber and 2 strips of avocado, follow by the crab. Make sure you don't overfill. Roll the California Roll using the bamboo mat and make sure that you tug the sushi rolls very tight. Keep rolling using the bamboo mat until you have have a nice roll.","Cut both ends of the sushi rolls using a sharp knife, about 1/2 inch off each end. Wipe off the residue on the knife and wet with some water before cutting each end. Wipe off the residue again and wet with some water before you start slicing the sushi rolls into pieces. Each roll should yield about 5 - 6 pieces of sushi.","Repeat the steps above to make 4 sushi rolls. Arrange the sushi on a plate and serve immediately with soy sauce, wasabi and pickled ginger."]},
    {"title":"Chicken Karaage (Sesame Fried Chicken) Recipe","summary":"Crispy and Crunchy Japanese fried chicken recipe with mayo miso dipping sauce just like your favorite Japanese restaurants | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2014/08/japanese_fried_chicken_thumb.jpg","time":"Total Time 25 minutes","ingredients":["1 lb boneless skinless chicken breasts/thighs, cut into cubes","3 inches ginger peeled, pounded with a mortar and pestle to extract 2 tablespoons juice","3 tablespoons soy sauce","6 tablespoons Japanese cooking sake","2 tablespoon Japanese mirin","Cornstarch for coating","Oil for deep frying","Sesame for garnishing","2 tablespoons mayonnaise","2 teaspoons white miso paste","2 teaspoon apple cider vinegar or Japanese rice vinegar","2 teaspoons honey","Pinch of sugar"],"instructions":["Use paper towels to pat dry the chicken pieces and transfer to a bowl. Add in the ginger juice, soy sauce, sake, mirin and marinate for 30 minutes. Transfer the chicken pieces out of the Marinade and coat them evenly with corn starch. Shake off excess.","Make the Miso Mayo Dip by whisking all the ingredients together. Set aside.","Deep-fry in oil for two times. Heat up a wok/pot of cooking oil. When the cooking oil is hot enough for frying, drop the chicken pieces into the oil and quickly deep fry them until they turn golden brown. Transfer them out onto a plate and wait for a couple of minutes. Put the chicken back into the oil and deep-fry until golden brown and crunchy. Dish out to a plate lined with paper towels to absorb the excess oil, serve hot with the Miso Mayo Dip."]},
    {"title":"Blue Apron Stir-Fry Chicken with Udon Recipe","summary":"Blue Apron Stir-Fry Chicken with Udon - delightful and chewy udon noodles blend seamlessly with tender chicken and sauteed peppers and bok choy. It's all complete with garnishes of scallions and crunchy cashews | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2018/04/chicken-stir-fry-with-udon-thumb-1.jpg","time":"Total Time 30 minutes","ingredients":["1 1/8 lbs chopped chicken breast","Salt","Ground black pepper","3 tablespoons olive oil","1/4 cup Blue Apron sushi sauce or soy sauce","1 tablespoon rice vinegar","1/2 cup water","1 lb fresh udon noodles loosened and separated","10 oz baby bok choy stems removed and chopped","3 tablespoons roasted cashew roughly chopped","1 1- inch piece ginger finely chopped","1/4 cup sweet chili sauce","2 stalks celery sliced","4 oz sweet peppers","2 stalks scallions roots trimmed, sliced and separating the white bottoms and green tops"],"instructions":["Season the chopped chicken cubes with salt and pepper. In a pan or skillet, heat 2 tablespoons of the olive oil on medium-high until hot. Add the chicken and cook, stirring occasionally, 6 to 8 minutes, or until browned and cooked through. Leaving the browned bits in the pan or skillet, transfer the chicken to a plate.","While the chicken cooks, in a medium bowl, whisk together the Blue Apron sushi sauce (or soy sauce), sweet chili sauce, vinegar and water.","Add the remaining 1 tablespoon of olive oil to the pan or skillet; heat on medium-high until hot. Add the celery, ginger, peppers and the white bottoms of the scallions. Cook, stirring frequently, 1 to 2 minutes, or until softened and fragrant.","Add the chopped bok choy, cook for 30 seconds to 1 minute, or until the leaves are wilted. Add the cooked chicken and the sauce to the pan or skillet. Cook, stirring frequently until well combined. Add the noodles, cook and stirring frequently, 3 to 4 minutes, or until thoroughly heated through. Turn off the heat and season with salt and black pepper to taste. Serve the dish with chopped cashew and the sliced green tops of the scallions."]},
    {"title":"Tebasaki (Nagoya Fried Chicken Wings) Recipe","summary":"Japanese Crispy Chicken Wings - easy recipe that produces the crispiest and best Japanese-flavored chicken wings ever | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/11/tebasaki_thumb.jpg","time":"Total Time 45 minutes","ingredients":["10 - 12 oz chicken wings party wings, middle section only","Pinch of salt","1/4 teaspoon white pepper","1 tablespoon potato starch","Oil for deep-frying","White sesame seeds","1 tablespoon Japanese soy sauce tamari preferred","1 tablespoon Mizkan Bonito Flavor Soup Base","3 tablespoons Mizkan Honteri Mirin","2 teaspoons sugar","1 tablespoon sake","1/2 teaspoon garlic powder","Tebasaki","Steamed rice","Black Sesame Seeds","1 cup finely cut cabbage","Mizkan Yuzu Citrus Salad Dressing","Tamagoyaki Japanese Rolled Omelet","Pickled Cucumber"],"instructions":["Rinse the chicken wings thoroughly and pat very dry with paper towels. Score the bottom part of the wings with two diagonal slits. Season with salt and white pepper, and lay the chicken wings on a flat surface to air dry for 30 minutes.","Heat up a deep-fryer to 300°F. Lightly coat and dust the surface of chicken wings with the potato starch. The coating should be very thin.","When the deep-fryer is ready, fry the chicken wings for 8 minutes or until they are light brown.","Remove the wings and turn up the heat on the deep-fryer to 375°F. Add the wings and deep fry for another 2 minutes or until very crispy. Remove and place on a paper towels to absorb the excess oil.","Heat up all the ingredients in the Glaze in a small saucepan on low heat. Simmer until the glaze slightly thicken. Add the wings into the saucepan and toss around to make sure that each wing is lightly coated with the Glaze. Shake off the extra Glaze off each wings and transfer the wings to a bowl.","Sprinkle some white pepper powder (to taste) on top of the tebasaki and toss around a few times. Top with sesame seeds and serve immediately.","Arrange the tebasaki in the biggest compartment on the bento box. Follow up the steamed rice topped with black sesame seeds. Add the cabbage salad and drizzle some Mizkan Mizkan Yuzu Citrus Salad Dressing on top. Arrange the tamagoyaki and pickled cucumber in the bento."]},
    {"title":"Pork and Shiitake Gyoza Recipe","summary":"Pork and Shiitake Gyoza - healthy and delicious Japanese dumplings that you can make at home with this super easy and fool proof recipe. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/04/pork-shiitake-gyoza-thumb.jpg","time":"Total Time 40 minutes","ingredients":["10 oz 300g ground pork (80% lean, 20% fat preferred)","1/2 cup cabbage finely chopped","1 stalk scallion finely chopped","3-4 dried shiitake mushrooms or fresh shiitake mushrooms","1 pack gyoza wrapper","1 tablespoon oil","1/2 cup water for steaming","1/4 cup water for sealing","1 tablespoon cooking sake","1 teaspoon mirin","1/2 teaspoon salt","1 teaspoon soy sauce","1/2 teaspoon sesame oil","3 dashes white pepper powder","4 tablespoons ponzu","1 teaspoon chili oil optional","1/2 teaspoon white sesame seeds"],"instructions":["In a small bowl, soak the dried shiitake mushrooms with warm water until they turn soft. Squeeze the water dry, discard the stems and cut the mushrooms into very tiny pieces. If you use fresh shiitake, just discard the stems and diced finely.","Mix the Dipping Sauce ingredients in a small sauce dish and set aside.","Add the chopped cabbage, scallion, and mushrooms into the pork, stir to combine. Add all the ingredients in Seasonings and blend well.","Place a gyoza wrapper onto your palm and place 1 teaspoon of the filling in the middle of the wrapper.Lightly dab your index finger into the 1/4 cup of water and circle your finger all around the outer edge of the wrapper. Pleat and fold the wrapper (starting from one end to the other end). Make sure the gyoza is sealed tight. Repeat the same until the filling is used up.","Use a flat bottom pan to pan fry the gyoza on medium heat. Add 1 tablespoon of oil into the pan and place all gyoza in the pan and cover it with the lid. Pan-fry the gyoza for 5 minutes or until the bottoms turn brown. Add 1/2 cup of water into the pan and turn the heat to high immediately. Cover the lid to steam and cook the gyoza for another 3-4 minutes, or until the water dries out. Turn the heat to low and pan fry the gyoza for another 1 minute to crisp up the bottom. Transfer the gyoza out onto a plate and serve immediately with the dipping sauce."]},
    {"title":"Chicken Teriyaki Recipe","summary":"Chicken Teriyaki – learn how to make teriyaki sauce and chicken teriyaki that taste like the best Japanese restaurants. So easy and so good.","img":"https://rasamalaysia.com/wp-content/uploads/2012/10/chicken-teriyaki-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 lb chicken thighs deboned, skin-on","Salt","White sesame seeds for garnishing","1/3 cup Japanese mirin sweet rice wine","2 tablespoons soy sauce   or San-J Tamari","1 tablespoon sugar"],"instructions":["Lightly season both sides of the chicken thighs with a little salt. Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On medium heat, reduce it to a thicker consistency about 10 minutes.","In the meantime, heat up a non-stick skillet on high heat. Pan-fry the chicken thighs (skin-side down first) until both sides are nicely browned and cooked through. The skin should be pan-fried to a crackly crispy texture. Turn off the heat, transfer the chicken out. Let cool. Slice the chicken thighs into pieces and drizzle the teriyaki sauce over the chicken and garnish with some sesame seeds. Serve immediately with steamed rice."]},
    {"title":"Teriyaki Chicken Recipe","summary":"Easy Teriyaki Chicken  - the most popular Japanese chicken dish. Learn how to make the best-ever chicken teriyaki with only four ingredients, plus step-by-step cooking video.","img":"https://rasamalaysia.com/wp-content/uploads/2015/04/teriyaki_chicken_thumb.jpg","time":"Total Time 30 minutes","ingredients":["12 oz skinless and boneless chicken thighs","1 1/2 tablespoons soy sauce or San-J Tamari","1 heaping tablespoon sugar or to taste","1 tablespoon Japanese cooking sake rice wine, optional","1 1/2 tablespoons oil","White sesame for garnishing"],"instructions":["Marinate the chicken with soy sauce, sugar, and cooking sake for 20 minutes. Heat up a skillet with the oil on low heat. When the oil is heated, transfer the chicken and the marinade sauce into the skillet and let cook slowly. Turn the chicken over after 5 minutes and continue to cook on low heat, for another 5 minutes.","Dish out and garnish with some sesame seeds. Serve immediately with steamed rice."]}
]