[
    {"title":"Bibimbap Recipe","summary":"Bibimbap is a Korean rice dish topped with vegetables. Bibimbap is delicious and this bibimbap recipe covers everything from making rice to the toppings. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2009/11/bibimbap.jpg","time":"","ingredients":["3 cups cooked white rice","2 tablespoons sesame oil plus extra for drizzling","3 tablespoons Tangy Red Pepper Dressing","1 fried egg sunny-side up","1/2 cup water","1 teaspoon fine-grain sea salt","12 oz soybean sprouts","4 tablespoons minced green onion scallions","1 tablespoon toasted sesame seeds","1 tablespoon dark sesame oil","4 carrots peeled and cut into 2-inch matchstick strips","1/２ teaspoon fine-grain sea salt","1 tablespoon dark sesame oil","4 Armenian or mini cucumbers or 1/2 English cucumber sliced in 1/4 – inch rounds","1 teaspoon fine-grain sea salt","2 tablespoons Tangy Red Pepper Dressing","1 tablespoon toasted sesame seeds","1 pound 500 g spinach, rinsed carefully","2 tablespoons toasted sesame seeds","2 tablespoons dark sesame oil","1 teaspoon fine-grain sea salt","2 oz rib eye cut into strips or ground beef","2 teaspoons soy sauce","1/2 teaspoon sesame oil","1 teaspoon brown sugar","2 tablespoons Korean red pepper paste available at Korean grocery","1 tablespoon rice or cider vinegar","1 teaspoon honey","1 tablespoon apple juice or water","2 teaspoons sesame oil"],"instructions":["In a medium-size saucepan, with a lid, combine the water, salt and soybean sprouts. Bring to a boil. Reduce to low heat, cover with a lid, and steam the sprouts for 5 minutes.","Strain the sprouts and transfer to a mixing bowl.","Mix the sprouts with the green onion, toasted sesame seeds","and sesame oil.","In a medium size skillet heat the sesame oil on medium heat. Add the carrots and salt.","Stir-fry the carrots for 2 minutes.","In a large bowl, toss the cucumbers and salt. Set aside for 5 minutes. Gently squeeze the liquid from the cucumbers. Transfer to a serving bowl.","Combine the Tangy Red Pepper Dressing and cucumbers. Sprinkle on the sesame seeds.","Fill a large pot with water and bring to a boil. Add the spinach and cook for 1 minute.","Strain the spinach into a colander and rinse with cold water. Take one handful of spinach at a time, and squeeze the water from the spinach. Lay the spinach on a cutting board and cut into 2-inch (5 cm) pieces.","Transfer the spinach to a bowl and add the sesame seeds, sesame oil, and salt. Mix well.","In a small bowl, mix together the beef, soy sauce, sesame oil and brown sugar. Let marinate for 15 minutes.","Heat a small skillet and stir-fry for 2 minutes.  Set aside.","In a medium bowl whisk the ingredients together","Have the seasoned salads and beef prepared in individual bowls.","Place a cast iron skillet or pot on medium heat and add 2 tablespoons of the sesame oil.","Heat the oil for 1 minute. Add the rice and spread it around the bottom of the pot to form an even layer. Cook the rice for several minutes or until the rice begins to brown on the bottom. You will hear the rice sizzle.","Carefully arrange each of the seasoned salads on top of the rice grouping each one like the spoke of a wheel. Place the beef in the center. Continue heating for 2 minutes.","Transfer the casserole to a heatproof pad. Set one fried egg in the center on top of the beef.","To serve: fold together the egg, vegetables, rice and 2 tablespoons of the Tangy Red Pepper Sauce. Make sure to scrape the bottom of the pot to distribute that crunchy crust throughout the dish.","Serve in individual bowls with a drizzle of sesame oil and extra Tangy Red Pepper Dressing.","*You can make one fried egg per person to mix into individual servings."]},
    {"title":"Kimchi Fried Rice Recipe","summary":"Kimchi Fried Rice - the easiest and best fried rice made with Korean kimchi. Spicy, flavorful and absolutely delicious. Dinner takes 15 mins.","img":"https://rasamalaysia.com/wp-content/uploads/2011/06/kimchi-fried-rice-thumb.jpg","time":"Total Time 15 minutes","ingredients":["2 tablespoons oil","1 large egg","1 clove garlic finely minced","1/4 small onion finely diced","1/2 cup kimchi cut into small pieces + 1 tablespoon kimchi juice","2 cups overnight steamed white rice","1 tablespoon soy sauce or to taste","1/4 teaspoon sesame oil","3 dashes black pepper","1 stalk scallion cut into small rounds"],"instructions":["Heat up a wok with 1/4 tablespoon oil and cook the egg sunny side up. Dish out and set aside.","Add the remaining oil into the wok. Sauté the garlic and onion until aromatic. Add the kimchi and do a few quick stirs before adding the rice. Stir to combine well. Add the soy sauce, sesame oil, black pepper, and scallion. Stir a few times to blend with the rice. Dish out and serve immediately with the egg on top of the rice."]},
    {"title":"Seaweed Salad Recipe","summary":"Seaweed is a healthy ingredient and this seaweed salad recipe is made of Korean dried seaweed, salt, sugar, rice vinegar, sesame oil and chili flakes.","img":"https://rasamalaysia.com/wp-content/uploads/2009/10/seaweed_salad-1.jpg","time":"","ingredients":["1 oz. dried seaweed miyeok","1 teaspoon of dried red chili flakes","1 teaspoon rice wine vinegar","1 teaspoon soy sauce","1 teaspoon sesame oil","Salt to taste","1 teaspoon honey or sugar","1/2 teaspoon white sesame seeds"],"instructions":["Heat up a pot of water and bring it to boil.  Boil the dried seaweed for about 3 minutes or until they turn soft. Drain the water and squeeze the excess water out of the seaweed. Set aside and let cool.","Add all seasonings and ingredients into the seaweed and toss well. Chill in the fridge and serve cold."]},
    {"title":"Korean B.B.Q. Chicken Recipe (Dak Gogi)","summary":"Korean BBQ Chicken (Dak Gogi) – juicy and delicious BBQ chicken served with an amazing Korean spicy dipping sauce. Serve with rice and lettuce leaves.","img":"https://rasamalaysia.com/wp-content/uploads/2014/06/korean-bbq-chicken-thumb.jpg","time":"Total Time 25 minutes","ingredients":["2 lbs boneless skinless chicken thighs","1/2 cup sesame oil","3 tablespoons soy sauce","3 tablespoons light corn syrup mul yut","1/3 cup shallots finely chopped","4 teaspoons finely grated peeled fresh ginger","4 teaspoons minced garlic","4 teaspoons mirin","2 teaspoons Korean red chile flakes gochugaru or crusted red pepper flakes","1/2 teaspoon salt","1/2 teaspoon pepper","1/4 cup thinly sliced scallions","2 tablespoon thinly sliced fresh long red chiles or big pinch of Korean chile threads","1 teaspoon roasted sesame seeds","16 lettuce leaves washed and dried","4 cups cooked white rice","Ssamjang sauce"],"instructions":["Rinse the chicken, remove the skin and bones. Pat dry with paper towels and set aside.","In a large bowl, mixing all the ingredients of the Marinade together.","Add the chicken to Marinade, make sure to stir coat the chicken evenly. Cover and refrigerate for 2 hours.","Fire up the grill, brush a bit of oil on the surface. Grill the chicken until they turn golden brown and charred on both sides. Removed from grill cut crosswise into 1 1/2-inch thick strips. Serve immediately with the Alongside."]},
    {"title":"Korean Kalbi Ribs","summary":"Kalbi (Korean BBQ Beef Short Ribs). Recipe at rasamalaysia.com.","img":"https://rasamalaysia.com/wp-content/uploads/2010/03/kalbi-1.jpg","time":"","ingredients":["3 lbs Flanken-style short ribs about 12 pieces","Water","1 Asian pear","1/2 a white or yellow onion","1 cup soy sauce I use Aloha shoyu","1 cup citrus soda like Sierra Mist","1 TBS freshly grated ginger","1/4 cup sesame oil","3 cloves garlic minced or pressed","2 TBS sesame seeds","1/4 tsp red pepper flakes","1/4 cup minced green onion"],"instructions":["Place ribs in a large casserole dish and fill it with water until the ribs are covered.  Let sit in the fridge at least 30 minutes, then pour off water and rinse the ribs and dish.","Return ribs to the casserole dish.  Grate the flesh of an Asian pear and half of an onion over the ribs.  Add all remaining ingredients to the ribs and use tongs stir marinade and make sure ribs are all soaking.  Cover the dish and refrigerate at least 30 minutes (overnight is better).","Heat a grill to medium high heat.  Use tongs to place ribs on the grill and cook for 3-4 minutes each side.  Garnish with additional green onion and sesame seeds if desired.  Serve with kimchee and rice."]},
    {"title":"Mandu Recipe (Korean Dumplings)","summary":"Korean mandu and mandu recipe. Mandu are Korean dumplings. Mandu is a must-have during Lunar New Year. Easy Mandu recipe made with kimchi.","img":"https://rasamalaysia.com/wp-content/uploads/2012/01/mandu_thumb.jpg","time":"","ingredients":["25 - 30 dumpling wrappers slightly thick","1 cup packed finely chopped kimchi","6 ounces tofu","8 ounces mung bean sprouts","1/2 medium onion","3 scallions","4 ounces ground pork and/or beef","1 tablespoon minced garlic","1 teaspoon finely grated ginger or juiced","2 teaspoons sesame oil","2 teaspoons soy sauce","1/2 egg use the other half to seal the wrappers","salt to taste about 1/4 teaspoon","pinch pepper"],"instructions":["Finely chop the kimchi and squeeze out as much liquid as possible by hand. Squeeze out water from tofu.","I usually place tofu under a heavy object such as cutting board to press out water first and then squeeze by hand. Also, using a cheesecloth will make squeezing easier. Blanch the bean sprouts in boiling water, drain, chop and squeeze out water. Finely chop the onion and squeeze out water. Finely chop the scallions.","The squeezed ingredients should be dry and crumbly. Combine all the ingredients in a large bowl and mix well by hand.","Place one heaping teaspoonful to a tablespoon of the filling on a wrapper. Wet the edges of the wrapper with water or egg wash and seal tightly (pushing the air out with your fingers) into a half-moon shape. (Stop here if you want a half-moon shaped dumplings.) Then, bring the two ends together, moist the overlapping side with water or egg wash, and press tightly together to create a round shape. Repeat this process until all the filling/wrappers are used.","Kimchi mandu can be steamed for about 8 minutes in a steamer (longer if frozen). Make sure to line the steamer with a cheesecloth or paper towel to prevent mandu from sticking.","Tips for freezing:","I usually make mandu in large quantities and freeze them for a quick snack or meal in the future. Freeze the dumplings on a tray with no pieces touching for about an hour, and then store them in a freezer bag. Otherwise, the skins will get soggy from the moisture in the filling and stick together in the freezing process.","Dipping Sauce:","1 tablespoon soy sauce","1 teaspoon vinegar","1 tablespoon water","1/2 teaspoon sugar","pinch of black pepper","pinch of red pepper flakes (gochugaru)","Combine all the ingredients above and mix well. Serve the mandu with the dipping sauce."]},
    {"title":"Spicy Korean Chicken Recipe","summary":"Spicy Korean Chicken – amazing and super yummy chicken with spicy Korean marinade. So easy to make, cheaper, and better than takeout.","img":"https://rasamalaysia.com/wp-content/uploads/2015/08/spicy-korean-chicken-thumb.jpg","time":"Total Time 25 minutes","ingredients":["1 lb boneless and skinless chicken thighs","2 tablespoons oil","1 1/2 tablespoons Korean chili paste gochujang","1 teaspoon Korean red chili powder gochugaru or regular chili powder","1 tablespoon sesame oil","2 tablespoons soy sauce","1 1/2 tablespoons sugar","1- inch piece ginger peeeled and minced","3 cloves garlic minced","Salt to taste"],"instructions":["Slice the chicken thighs horizontally to make thinner pieces of meat. Slice each piece of chicken thigh (depends on its thickness) into 2 or 3 horizontal pieces. Set aside.","Combine all the ingredients in the Marinade in a bowl, whisk it to make sure the Korean chili paste (gochujang) is completely dissolved. Marinate the chicken for at least 30 minutes or best for two hours.","Grill the chicken until slightly charred and completely cooked through. You may also pan-fried the chicken on a skillet or pan, or bake in the oven at 400F for about 20 minutes. Serve immediately with steamed rice."]},
    {"title":"Spicy Korean Tofu Recipe","summary":"Spicy Korean Tofu - quick and easy Korean braised tofu with chili powder, garlic, soy sauce, sugar and sesame oil. This Korean side dish (banchan) is healthy and delicious.","img":"https://rasamalaysia.com/wp-content/uploads/2018/03/spicy-korean-tofu-thumb-1.jpg","time":"Total Time 20 minutes","ingredients":["1 box 16 oz firm tofu","1 tablespoon oil","1 1/2 tablespoons soy sauce","1 tablespoon sugar","1 stalk green onion stem removed and cut into small rounds","2 cloves garlic minced","1 1/2 tablespoons Korean red chili power","1 red chili seeded, pounded with mortar and pestle, optional","1 teaspoon white sesame","1 tablespoon sesame oil","1/3 cup water"],"instructions":["Cut the tofu into rectangle shapes, about 1/4-inch thickness. Pat dry with paper towels. Mix all the ingredients in the Sauce together. Set aside.","Heat up a non-stick skillet on medium heat and add the oil. When the oil is heated, add the tofu and pan fry until brown on both sides. Add the sauce to the skillet and lower the heat. Simmer the tofu until the sauce reduces but still somewhat wet. Turn the tofu over to simmer on both sides.","Transfer to a serving platter and top with chopped scallions. Serve at room temperature."]},
    {"title":"Bulgogi Lettuce Wraps Recipe","summary":"Bulgogi Lettuce Wraps - how to make Korean beef bulgogi with simple ingredients and serve as lettuce wraps. A healthy appetizer for any occasions.","img":"https://rasamalaysia.com/wp-content/uploads/2018/02/bulgogi-lettuce-wraps-thumb.jpg","time":"Total Time 15 minutes","ingredients":["12 oz thinly sliced sirloin","1 tablespoon vegetable oil","1/4 small onion thinly sliced","2 cloves garlic finely minced","1 1/2 tablespoons soy sauce","1 tablespoon sugar","3 dashes McCormick® Chili Powder","3 dashes McCormick® Black Pepper Coarse Ground","1 tablespoon chopped scallion","White sesame for garnishing","Kimchi sliced, for garnishing, optional","1 head butter lettuce or iceberg lettuce"],"instructions":["Marinate the sirloin with garlic, soy sauce, sugar, McCormick® Chili Powder and McCormick® Black Pepper, Coarse Ground. Stir to mix well. Set aside for 15 minutes to marinate.","Heat up a skillet with the vegetable oil. Add the onion and saute for about 10 seconds. Add the sliced sirloin. Stir and cook until the meat is cooked. Top with the scallion and white sesame. Transfer out to a serving platter.","Tear off the leaves from the lettuce. To assemble the Bulgogi Lettuce Wraps, add 1 tablespoon of the Bulgogi onto the center of the lettuce leaf, then top with the sliced kimchi, if using. Serve immediately."]},
    {"title":"Japchae (Chap Chae) Recipe","summary":"Japchae or chap chae is a popular Korean noodle dish made with sweet potato noodles. Learn how to make japchae at home in 30 minutes. Easy japchae recipe.","img":"https://rasamalaysia.com/wp-content/uploads/2011/06/japchae-thumb.jpg","time":"Total Time 20 minutes","ingredients":["8 oz sweet potato noodles","4 oz spinach","1 1/2 tablespoons oil","2 cloves garlic minced","1/2 small onion thinly sliced","3-4 dried shiitake mushrooms soaked in warm water, stem removed and sliced","1 small carrot cut into thin strips","1 stalk scallion cut into 1-inch lengths","1/2 tablespoon sesame oil","Salt to taste","1 heaping teaspoon toasted white sesame","4 tablespoons soy sauce","2 1/2 tablespoons sugar"],"instructions":["Cook the sweet potato noodles in a large pot of boiling water for about 5 minutes. Drain the water and rinse the noodles under cold running water. Cut the noodles using a pair of scissors into about 6-inch lengths. Set aside.","Heat up a pot of water and bring it to boil. Blanch the spinach until they are wilted, about 1 minute. Drain the water and rinse the spinach under cold running water. Form the spinach into a ball and squeeze it to discard  the remaining water. Cut the spinach ball into half.","Heat up the oil in a skillet or wok and add the garlic, onion, mushroom, and carrot and cook for about two minutes. Add the scallion and stir-fry for another minute. Turn the heat to low and add the noodles and spinach into the skillet or wok, follow by the sesame oil, the Sauce, and salt to taste. Stir to combine well. Dish out, sprinkle with the sesame seeds, and served at room temperature."]},
    {"title":"Korean Fried Chicken Recipe","summary":"Korean Fried Chicken – the BEST Korean fried chicken recipe that yields crispy fried chicken in spicy, savory and sweet sauce. Finger lickin’ good!","img":"https://rasamalaysia.com/wp-content/uploads/2016/06/korean-fried-chicken-thumb.jpg","time":"Total Time 30 minutes","ingredients":["1 lb chicken wings drummettes and wingettes","Salt","Ground black pepper","1/2 cup potato starch","Oil for deep-frying","White sesame for garnishing","2-3 tablespoons Korean gojuchang red pepper paste","1 tablespoon apple cider vinegar","1 tablespoon hot water","2 tablespoons honey","1 tablespoon soy sauce"],"instructions":["Season the chicken with some salt and black pepper, then coat well with the potato starch. Set aside.","Combine all the ingredients for Dressing together, stir to mix well.","Heat up a Dutch oven, deep skillet or pan with 3 inches of oil. Heat the oil to 375F. Coat the wings again and shake off the excess potato starch. Drop the wings gently into the oil and deep-fry until light brown or when they are cooked and become crispy. Remove the wings from the oil and drained on paper towels. Combine the Dressing and the wings, toss to coat well. Garnish with the sesame and serve immediately."]},
    {"title":"Kimchi Ramen Recipe","summary":"Kimchi Ramen – spicy Korean ramen with kimchi, mushroom and poached egg. Easy kimchi ramen recipe that takes only 15 mins to make | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2017/02/kimchi-ramen-thumb.jpg","time":"Total Time 15 minutes","ingredients":["2 large eggs","Water","4 cups chicken broth","2 packs instant ramen","1 cup kimchi with juice, sliced","2 tablespoons Korean hot pepper paste Gochujang","1 teaspoon Korean chili powder Gochugaru","4 oz. mushrooms white button mushroom, buna shimeji or shiitake","1 teaspoon sesame oil","Salt to taste","2 tablespoons chopped scallion"],"instructions":["Bring a pot of water to a boil and then lower to a bubbling simmer. Poach the eggs by dropping each egg gently in the water and cook for about 4-5 minutes. Make sure the water covers the eggs. Remove the eggs with a strainer. Set aside.","Heat up the same pot and add the chicken broth. Bring it to boil. Add the kimchi, pepper paste, chili powder and ramen. When the ramen is about half done, add the mushroom and sesame oil. Add salt to taste. Transfer the noodles to two bowls and top with the poached eggs and scallions. Serve immediately."]},
    {"title":"Spicy Korean Chicken Wings Recipe","summary":"Spicy Korean Chicken Wings - crazy yummy baked Korean chicken wings with sweet and savory Korean red pepper sauce. Finger lickin' good!","img":"https://rasamalaysia.com/wp-content/uploads/2016/11/spicy-korean-chicken-wings-thumb.jpg","time":"Total Time 55 minutes","ingredients":["2-3 lbs chicken wings wingettes and drumettes only","Salt","Ground black pepper","3 cloves garlic minced","3 tablespoons Korean red chili pepper paste Gochujang","1/2 teaspoon Korean chili powder Gochugaru","2 tablespoons soy sauce","1/2 tablespoon Apple cider vinegar or Asian","2 tablespoons sugar","2 tablespoons water","1 teaspoon sesame oil","White sesame for garnishing","Chopped scallions for garnishing"],"instructions":["Preheat the oven to 450°. Line a baking sheet with parchment paper. In a large bowl, season the wings with salt and pepper. Transfer the wings, skin side up, on the baking sheets and roast them for about 40 - 45 minutes, until they are cooked through and crisp.","In a small sauce pan, add the remaining ingredients except white sesame and scallions. Heat on low heat, whisk to mix well. Turn off the heat when it becomes saucy.","Toss the baked chicken wings with the sauce, coat well. Garnish with the sesame and scallions. Serve immediately."]},
    {"title":"Bulgogi Recipe","summary":"Bulgogi and Bulgogi recipe. Bulgogi is marinated meat dish with Korean red chili paste. Anyone can make bulgogi with this easy bulgogi recipe. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/10/bulgogo_thumb.jpg","time":"","ingredients":["1 pound thinly sliced pork belly or pork shoulder","1/2 medium onion thinly sliced","2 - 3 scallions roughly chopped","3 tablespoons Korean red chili pepper paste* gochujang","1 tablespoon Korean red chili pepper flakes gochugaru","2 tablespoons soy sauce","2 tablespoons rice wine (or mirin )","2 tablespoons sugar","1 tablespoon sesame oil","1 tablespoon minced garlic","1 tablespoon grated ginger","1/8 teaspoon black pepper"],"instructions":["Mix all marinade ingredients well.","Cut the pork belly into bite size pieces (about 2-inch long).","Combine the meat, onion, and scallions with the marinade and mix well. Marinate for at least an hour.","Heat a grill pan or a skillet over medium high heat and add the pork slices. Cook until the pork is cooked through and slightly caramelized, turning over once."]},
    {"title":"Beef Kimbap Recipe","summary":"Kimbap Recipe | Easy Asian Recipes | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/11/kimbap_thumb.jpg","time":"","ingredients":["6-7 Sheets dried laver seaweed","A 9 or 10 oz bag of ready to use spinach","1 log of yellow pickled radish or “danmuji”","1 large carrot or 2 medium sized carrots, peeled","5 Eggs","Kosher salt divided","Sesame oil , divided","Olive oil divided","Roasted sesame seeds divided","1 lb ground beef","2 cloves garlic finely minced","3 Tbsp soy sauce","2 Tbsp sugar","2 tsp sesame oil","6 cups cooked 3 cups uncooked short grain or sushi rice","½ Tbsp Sesame oil","½ Tbsp Olive Oil","½ Tbsp Sesame Seeds","¼-½ tsp kosher salt or to taste"],"instructions":["In a bowl, combine all the ingredients for the beef. Mix everything together by hand and set it aside to marinate while you prepare the other ingredients. When all the other ingredients are prepped, and the beef has had time to marinate, heat a large pan with some olive oil and fry the beef until it is nicely browned. Remove the beef with a slotted spoon into a bowl and set aside.","Add the entire 9 or 10 oz bag of ready to use spinach in salted boiling water. Boil for 30 seconds, and drain. Run cold water over it to stop the cooking, and squeeze out all the excess moisture with your hand. Transfer to a bowl and season with 1 teaspoon sesame oil, and a couple pinches of kosher salt. Mix well. Set aside.","Slice the log of radish into ½” thick slices. Cut each slice into strips, so that you end up with thin long strips, about ½” thick in diameter. Set aside.","Peel and slice your carrot(s) thinly on a diagonal. Lay the slices flat and run your knife through them lengthwise to create thin julienned slices. Saute them in a pan with some olive oil and season with a couple pinches of salt to taste. Set aside.","Break 5 eggs and add a couple pinches of salt. Whisk well. Heat a large pan with olive oil over medium low heat. Use a paper towel to wipe the pan so that it is evenly coated. Pour in the eggs and let it cook until the bottom is firm and light golden brown. Flip the egg over and cook until light golden brown. Remove to a plate and cut the egg into half-inch strips. Set aside.","Mix the rice last. After all the ingredients are prepped and the beef is cooked, place the 6 cups of cooked rice into a large bowl, along with the other ingredients for the rice. Mix gently, and get everything ready for assembly.","Place a sheet of dried laver seaweed, shiny side down, on a bamboo mat. Starting from the bottom, spread some rice in a thin even layer, filling about ⅔ of the seaweed sheet.","All of the filling that goes on top of the rice should start at 1” from the bottom, and have 2” of rice above it. Place the danmuji and egg first, leaving a gap in between them. In that gap, add your beef in a neat row. On top of the beef, place the carrot and spinach side by side, also in neat rows.","Starting from the bottom, roll the seaweed sheet, using the mat. The first roll should land right where that excess rice is. That will help it stick together. Gently push and squeeze down on the bamboo mat. Move the mat a litttle further away from you, allowing the kimbap to roll with it. Again, squish down and press with your hands. Then wrap and roll the entire kimbap up in the mat. Squeeze firmly across the entire length of the mat to make the sure the kimbap is tight. If you’re having trouble keeping the seaweed shut, add a few grains of the rice at the edge of the seaweed sheet.","Use a brush or a gloved hand to put some sesame oil on the surface of the kimbap rolls. This adds flavor and helps keep the kimbap shiny. It also helps to add a little sesame oil to your knife blade. With a sharp knife, slice the kimbap into thin half inch or bite sized pieces. Kimbap is characteristically sliced thinner than Japanese maki. You can then sprinkle with some more roasted sesame seeds if you want. Pop it into your mouth and enjoy your hard work!"]},
    {"title":"Japchae Recipe","summary":"Japchae is Korean mixed noodles. This japchae recipe is easy to make and yields the best japchae by using store-bought ingredients and sauce. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2014/03/japchae_thumb1.jpg","time":"Total Time 30 minutes","ingredients":["2 tablespoons oil","1/2 tablespoon sesame oil","3 garlic finely minced","1/2 onion thinly sliced","2 oz Busan fish cake cut into thin strips","2 oz fresh wood ear mushrooms or 1 oz dried wood ear or 1 oz or Shiitake mushroom, cut into pieces","1/2 red bell peppers cut into thin strips","1 cup tightly packed spinach with stems","1/2 carrot peeled and cut into matchstick strips","1 stalk scallion cut into thin threads","12 oz dried Korean sweet potato noodles","1/2 cup Mizkan Oigatsuo Tsuyu Bonito Flavored Soup Base green label no MSG, or more to taste","1/4 cup Mizkan Honteri Mirin","2 tablespoons sugar","3 heavy dashes black pepper powder","Toasted white sesame seeds"],"instructions":["Closewise from top: dry sweet potato noodles, fresh wood ear mushrooms, and Busan fish cake.","Heat up a big pot of water and bring it to boil. Cook the sweet potato noodles in the hot boiling water until the noodles are completely cooked through but remain al dente. Rinse the noodles with cold running water to remove the starch from the noodles. Transfer to a colander and let the excess water drain. Set aside.","Heat up a stir-fry pan and add the oil and sesame oil, on medium heat. Stir-fry the garlic and onion until aromatic, then add the fish cake, wood ear mushrooms, and red bell peppers. Stir-fry for 1 minute before adding the spinach, carrot and scallions. As soon as the spinach leaves start to wilt, turn off the heat but leave the pan on the stove.","Transfer the noodles into the pan. Add the Mizkan sauces, sugar, and black pepper. Using a pair or chopsticks, toss and combine the noodles with all the ingredients in the pan. Continue to toss and mix until everything is well combined. Add more Mizkan Oigatsuo Tsuyu Bonito Flavored Soup Base to taste if you like. Adjust the taste by adding more sauce and/or sugar until the Japchae reach your desired taste. Transfer into bowls, topped with some toasted white sesame seeds and serve immediately."]},
    {"title":"Korean Kalbi Taco Recipe","summary":"Korean kalbi (BBQ beef short rib) tacos. Amazing tacos with tender, juicy and the most delicious Korean kalbi | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/06/korean-bbq-kalbi-taco-thesis.jpg","time":"Total Time 36 minutes","ingredients":["3 pounds beef short ribs or Korean Kalbi about 11-12 pieces","1/2 Romaine lettuce thinly shredded","1/2 red onion diced","1  tomato seeded and diced","1 cup chopped cilantro","18 small flour or corn tortilla","1-2 lemons thinly sliced for garnishing","1 Asian pear","1/2 a white or yellow onion","1 1/4 cups soy sauce","2 tablespoons sugar","1 cup citrus soda","1 tablespoon freshly grated ginger","1/4 cup sesame oil","3 cloves garlic minced","2 tablespoons sesame seeds","3 tablespoons sesame oil","1/2 cup lemon juice","4 tablespoons soy sauce","1 1/2 tablespoons Gochugaru Korean chili powder","3 tablespoons toasted sesame seeds","1 teaspoon sugar","Salt to taste"],"instructions":["Marinade the beef short ribs with the Marinade for at least 30 minutes, overnight is best. Refer to the Korean BBQ Beef Short Ribs Recipe for the step-by-step instructions on how to marinade.","Prepare the ingredients for the Sauce and mix well. Refrigerate until use. Prepare the Romaine lettuce, red onion, tomato and cilantro in separate bowls.","Wrap the tortilla in aluminum foil and warm them in the oven at the lowest setting for a few minutes. Toss the shredded Romaine lettuce with 1/2 of the sauce. Save the remaining sauce for the tacos.","Grill the marinated beef short ribs, each side for 3-4 minutes. When all the ribs are done, cut the meat into 1/2 inch cubes.","Place the beef short-rib cubes on the tortilla. Add some seasoned lettuce. Top it with the diced red onion, tomato and cilantro. Drizzle some sauce on top, garnish with a sliced lemon and serve."]},
    {"title":"Korean Spicy Chicken Stew","summary":"Korean Spicy Chicken Stew - potatoes, chicken, onion, baby carrots, scallions, soy sauce, chili paste. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/11/korean_chicken_stew_thumb.jpg","time":"","ingredients":["2 tablespoons oil","1 1/4 lbs chicken cut into pieces and seasoned with some salt and pepper","1 onion sliced","10 oz potatoes cut into pieces","5 baby carrots","2 stalks scallions cut into 2-in lengths","3 tablespoons Korean chili paste","1/2 cup water","1 teaspoon Korean chili powder","1 tablespoon rice wine (or sake)","1 tablespoon soy sauce","1 teaspoon anchovy sauce or fish sauce or to taste"],"instructions":["Heat the oil in a large pot over high heat. Working in batches if necessary, add the chicken, skin-side down, and brown on both sides, about 6-7 minutes per side.","In a small bowl, combine all the Seasoning ingredients and mix well. Set aside.","When all the chicken is browned, add the onion, potatoes, baby carrots, and scallions. Stir a few times to combine well. Add the Seasoning into the pot, stir to blend well with all the ingredients. Cover the pot reduce the heat to medium-low, stirring now and then. Cook for about 45-60 minutes or until the chicken is cooked through and the potatoes are tender. Add some water if the stew is too dry."]},
    {"title":"Korean Clam Soup Recipe","summary":"Korean Clam Soup - savory and briny clam soup with jalapeno and garlic. Easy recipe that takes only 10 minutes to make and so delicious | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2017/09/korean-clam-soup-thumb.jpg","time":"Total Time 15 minutes","ingredients":["1 1/2 lbs Manila clams","4 cups water","1 stalk scallion cut into strips","4 cloves garlic sliced into pieces","1 small jalapeno seeded and sliced"],"instructions":["Clean, scrub and rinse the clams with cold water. Drain and set aside.","Heat up the water in a soup pot. Bring the water to boil. Add the garlic, jalapeno and clams to the water. Boil and cook until all clams are open. Add salt and scallion. Turn off the heat and serve immediately."]},
    {"title":"Bean Sprout Beef Rice Bowl Recipe","summary":"Bean Sprout Beef Rice Bowl recipe - seasoned ground beef, bean sprouts, rice, chive dressing. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2010/10/beef_rice_bowl.jpg","time":"","ingredients":["1 package 16oz soy bean sprouts cleaned and preferably tails removed","5-6 dried large anchovies head and black gills removed","2-3 dried sea kelp","1 1/2 C short grain white rice preferably Korean or Japanese","1/2 lb ground beef","3-4 Tbsp chopped Asian chives or regular chives or green onion","2 Tbsp Korean chili flakes","1/2 green chili seeded and chopped","1/2 red chili seeded and chopped optional","1 garlic finely minced","4-5 Tbsp low sodium soy sauce","1 Tbsp sesame oil","1 Tbsp roasted sesame seeds","dashes of black pepper","2 Tbsp low sodium soy sauce","1 Tbsp sugar","1/4 pear or apple pureed","1 Tbsp mirin or rice wine","1 garlic chopped","1/2 tsp freshly ground black pepper","2 tsp sesame oil","2 tsp roasted sesame seeds"],"instructions":["Soak the rice in the water for 30 minutes and drain. Set aside. Prepare the beef in the marinade and chill until ready to cook.","Meanwhile place bean sprouts in a pot with dried anchovies and sea kelp on the bottom with 1 cup of water. Cover with lid and cook over medium high heat until the steam comes out, reduce heat to low, continue to cook for another 6 minutes. Do not peak. You need to keep the pot covered. Drain the bean sprouts and reserve the broth from them. You will need 1 1/2 cup of the broth. If not enough, add water to fill in. Discard the anchovies and sea kelp. Set aside the bean sprouts covered.","Cook the rice in a rice cooker or heavy bottom pot with the reserved broth. Cook the beef in a pan until browned. No need oil.Make the dressing by mixing all the ingredients.","Place cooked hot rice in a big individual bowl, top with beef and bean sprouts, and the chive dressing (about 1 1/2 Tbsp or more per person). Drizzle more sesame oil in you wish. Mix everything very well until they get nicely incorporated. Serve with some Kimchee as a side if you have."]},
    {"title":"Sweet and Sticky Korean Fried Chicken","summary":"Easy, sweet and sticky Korean Fried Chicken recipe that takes only 3 key ingredients: chicken, soy sauce, and sugar. Recipe by Damn Delicious. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/06/korean_chicken_wings_thumb.jpg","time":"","ingredients":["2 cups vegetable oil","2 pounds chicken wings","Kosher salt and freshly ground black pepper to taste","1/2 cup soy sauce","1/4 cup plus 2 tablespoons sugar"],"instructions":["Heat vegetable oil in a Dutch oven or large pot over medium high heat to 350 degrees F.","Season chicken wings with salt and pepper, to taste.","Working in batches, add the chicken wings to the Dutch oven, 5 or 6 at a time, and fry until light brown, about 2-3 minutes. Transfer to a paper towel-lined plate.","Increase oil temperature to 400 degrees F. Add the chicken wings to the Dutch oven again and cook until golden brown and crispy, about 2 minutes on each side. Transfer to a paper towel-lined plate.","Heat soy sauce and sugar in a small saucepan over medium high heat. Bring to a boil; reduce heat to low and simmer, stirring occasionally, until sauce has thickened, about 2-3 minutes.","Serve wings immediately, tossed with soy sauce glaze."]},
    {"title":"Pajeon (Korean Scallion Pancake)","summary":"Korean Scallion Pancake (Pajeon) - savory pancake with scallion and kimchi, amazing appetizer that you can't stop eating | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2011/08/pajeon_thumb.jpg","time":"Total Time 25 minutes","ingredients":["1 cup all-purpose flour sifted","1 large egg","1/2 cup water","2-3 tablespoons kimchi juice","2 stalks scallion cut into small rounds","1/2 teaspoon salt","Oil for pan-frying","2 tablespoons soy sauce","1/4 teaspoon rice vinegar","Pinch of red chili flakes","1/2 teaspoon sugar","1 clove garlic finely minced"],"instructions":["Mix all the ingredients (except the oil) in a bowl, stir the batter to blend well. Combine all the ingredients of the Dipping Sauce in a saucer.","Heat up a pan and coat with some oil. Ladle some batter onto the pan to form a mini round pancake. Pan-fry for a couple of minutes until the bottom surface turns slightly brown, flip it over and cook the other side until slight brown. Dish out and repeat the same for the remaining batter.","Serve the pajeon warm with the Dipping Sauce."]},
    {"title":"Kimchi Dumplings","summary":"Kimchi Dumplings - Spice up your dumplings by adding kimchi to make juicy, plump and delicious dumplings that you just can't stop eating!! | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2014/07/kimchi-dumplings-thumb.jpg","time":"Total Time 30 minutes","ingredients":["1 pack dumpling wrappers round-shaped","Oil for pan-frying","1 oz bunch Korean dried sweet potato noodles","8 oz ground pork","2 oz kimchi squeeze and discard the excess kimchi juice and then finely sliced","1 heaping teaspoon grated ginger","1 tablespoon chopped scallion","2 tablespoons soy sauce","1 teaspoon rice wine","1/2 teaspoon sesame oil","3 dashes white pepper","Pinch of salt","Chinese black vinegar or Japanese ponzu for dipping","Chopped Scallion","Sesame seeds"],"instructions":["Cook the sweet potato noodles by following the packaging instructions. Once cooked, rinse with cold water, drained, pat dry with paper towels and roughly chopped them into short strands.","Make the Dipping Sauce by combining all ingredients together in a small dip bowl. Set aside.","Combine the chopped sweet potato noodles with the rest of the Filling ingredients. Stir to combine well until the filling becomes sticky and all mixed together.","To assemble the dumplings, place a piece of the wrapper on your palm and spoon 1/2 heaping tablespoon of the filling onto the center of the wrapper. Do not overfill. Dip your index finger into a small boil of water and moisten the outer edges of the wrapper. Fold the dumpling to form a half-moon shape and then pinch to from about 5-6 pleats. Press and seal tightly. Arrange the wrapped dumplings on a plate lined with parchment paper to avoid the dumpling from sticking to the bottom of the plate. Repeat the steps above until the filling is used up.","Heat some oil in a small skillet or pan over low to medium heat. Arrange 8 dumplings on the skillet or pan. Pan-fry the dumplings until the bottom turns light brown, about 2 to 3 minutes. Turn over and pan-fry the other side until light brown. Cover the skillet or pan with its lid while cooking. Repeat the same until all dumplings are cooked. Serve the dumplings warm with the Dipping Sauce."]}
]
