[
    {"title":"B.B.Q. Pork Chop Recipe","summary":"Thai BBQ Pork Chops. Quick, juicy, no-fuss pork chop recipe with simple marinades. Perfect dish for weeknight dinner for the family. You can make it with chicken instead of pork.","img":"https://rasamalaysia.com/wp-content/uploads/2014/06/thai_pork_chop_thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 lb pork chop","1 tablespoon oil","1 1/2 tablespoons fish sauce","1 teaspoon sweet soy sauce","1 teaspoon sugar","1/4 teaspoon pepper","1/4 teaspoon turmeric powder","2 cloves garlic minced","1/2 tablespoon minced cilantro stems","3 tablespoons coconut milk"],"instructions":["Rinse the pork chops and pat dry with paper towels. Set aside.","Get a bowl, mixing the rest of the ingredients together to form a marinade.","Transfer the pork chops into a sealable plastic bag and slowly pour the marinade into the pork chops, make sure they are nicely coated with the marinade. Marinate for 2 hours or overnight.","Fire up the grill, brush a little bit of oil on the surface of the pork chops. Turn pork chop over several times during grilling until cooked. Serve immediately."]},
    {"title":"Thai Chili Chicken Recipe","summary":"Thai Chili Chicken Recipe | Easy Asian Recipes rasamalaysia.com | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/thai_chili_chicken_thumb.jpg","time":"Total Time 15 minutes","ingredients":["2 tablespoons oil","1 teaspoon garlic minced","6 oz chicken breast cut into strips","1 cup bamboo shoots sliced into thin pieces","1 red chili sliced into thin strips","1 cup fresh mint leaves","Squirts of lime juice","2 tablespoons fish sauce","1 teaspoon sugar or to taste","2 teaspoons chili sauce I used Rooster brand chili garlic sauce","4 tablespoons thick coconut milk or coconut cream"],"instructions":["Mix the Sauce ingredients in a small bowl and set aside.","Heat up a wok with cooking oil and add garlic until aromatic.","Add in the chicken and stir-fry for a couple of minutes, add the bamboo shoots, chili, and mint leaves and stir fry until the chicken is cooked.","Add the Sauce and stir evenly. Add a few squirts of lime juice, dish out and serve with steamed rice."]},
    {"title":"Green Papaya Salad (Som Tum) Recipe","summary":"Thai green papaya salad – the best salad ever with shredded green papaya, long beans and tomatoes. So yummy!","img":"https://rasamalaysia.com/wp-content/uploads/2011/11/som_tam_thumb.jpg","time":"","ingredients":["1 clove garlic","1 or 2 red Thai bird's eye chilies","2 tablespoons dried shrimp","Thai palm sugar to taste","1/4 cup roasted peanuts","6 oz green papaya strands","6 cherry tomatoes I used grape tomatoes","1/3 cup long green beans cut into 1-inch lengths","Fresh lime juice to taste","Fish sauce to taste"],"instructions":["Pound the garlic and bird's eye chilies until they form a smooth paste.","Add the dried shrimp and pound until the pieces are broken up, but not completely pulverized.","Add the palm sugar (cut into small pieces), maybe 2-3 teaspoons at first. More more to taste later.","Add the peanuts and lightly pound until they are broken into tiny pieces, but not to the point where they form a thick paste.","Add the green beans and crush them with the mortar until they're splitting and lightly bruised.","Add the papaya and tomatoes and pound on them to bruise them. You want to crush the tomatoes so they release their juices and give their flavor and color.","Add a couple of teaspoons of fish sauce and a couple of teaspoons of lime juice to the mix.","Have in one hand a large spoon to help flip things over in and scrape down the sides of the mortar while your other hand pounds away with the pestle.","Keep pounding and flipping for a few seconds, add more fish sauce, lime juice, or palm sugar as needed.","Dish out and serve immediately."]},
    {"title":"Thai Fried Chicken Recipe","summary":"Thai Fried Chicken - the BEST fried chicken recipe ever, marinated with cilantro, garlic and Asian seasonings. Crispy, moist and so good!","img":"https://rasamalaysia.com/wp-content/uploads/2009/01/thai-fried-chicken-thumb.jpg","time":"Total Time 30 minutes","ingredients":["2 lbs chicken drumsticks, thighs, breasts, or cut-up chicken pieces)","6 cloves garlic peeled and pounded","2 tablespoons cilantro roots or use the cilantro stems, without leaves","1 teaspoon sea salt large-grained or kosher salt","4 tablespoons fish sauce","2 tablespoons oyster sauce","1/2 tablespoon ground black pepper","Oil for deep-frying","4 tablespoons all-purpose flour","4 tablespoons cornstarch","4 tablespoons rice flour"],"instructions":["Clean the chicken and pat dry with paper towels.","Use a mini food processor or a mortar and pestle to blend the garlic, cilantro roots and salt until they become a fine paste.","Add the paste, fish sauce, oyster sauce, ground black peppper to the chicken and mix well. Transfer the chicken into a big Ziploc bag and marinate for four (4) to six (6) hours in the fridge, or best overnight.","When ready, heat up a pot of cooking oil or use a deep fryer. While waiting for the oil to heat up, mix the three types of flour together in a new Ziploc bag. Add the chicken and coat evenly with the flour mixture. Shake the excess flour off.","Drop the chicken gently into the oil and deep fry the chicken until crispy and golden brown (the inside should cook thoroughly but remains juicy). Transfer the fried chicken out on a plate lined with paper towels to soak up the excess oil.","Serve the fried chicken immediately with Thai sweet chili sauce."]},
    {"title":"Thai Sweet Chili Chicken Recipe","summary":"Thai Sweet Chili Chicken – amazing and best-ever chicken recipe with sticky, sweet and savory sweet chili sauce. SO good you will want to lick the plate!!","img":"https://rasamalaysia.com/wp-content/uploads/2015/04/sweet_chili_chicken_thumb.jpg","time":"Total Time 25 minutes","ingredients":["8 oz skinless boneless chicken breast/thigh, cut into small pieces","Oil for deep-frying","1 tablespoon oil","2 cloves garlic minced","4 tablespoons bottled Thai sweet chili sauce","1 teaspoon lime juice","Pinch of salt","1/2 teaspoon white sesame","1/2 tablespoon chopped cilantro leaves","1 egg white","1/2 cup all-purpose flour sifted","1/4 cup cornstarch","1/2 teaspoon baking powder","1/2 cup water ice cold","1 tablespoon cooking oil","Pinch of salt"],"instructions":["Mix all the ingredients for the Batter until well combine. Add the chicken into the batter.","Heat up a wok/skillet with about two inches of oil. As soon as the oil is fully heated, deep-fry the chicken until golden brown. Transfer the chicken out to a dish lined with paper towels to sock up the excess oil.","Clean the wok/skillet and heat it up on medium heat. Add the oil and stir-fry the garlic until aromatic. Transfer the fried chicken into the wok, follow by the sweet chili sauce, lime juice and salt. Stir to coat the chicken well with the sweet chili sauce.","Dish out, garnish with the white sesame and cilantro leave. Serve immediately."]},
    {"title":"Mango Sticky Rice Recipe","summary":"Mango sticky rice – a popular sweet sticky rice with coconut milk and fresh mangoes. Make your favorite Southeast Asian dessert at home.","img":"https://rasamalaysia.com/wp-content/uploads/2014/11/mango-sticky-rice-thumb-1.jpg","time":"Total Time 40 minutes","ingredients":["1 cup 200g/7oz glutinous rice","2-3 Pandan screwpine leaves, cut into 2-inch length","2-3 Asian mangoes cut into small cubes","1 cup 250ml coconut milk","1/2 teaspoon salt","1/4 cup 55g/2oz sugar","1 tablespoon toasted sesame seeds optional","Banana leaf for steaming"],"instructions":["Soak the glutinous rice for at least 8 hours or overnight.","Prepare the steamer with a banana leaf. Drain the glutinous rice and spread it out on the banana leaf. Throw in the Pandan leaves. Steam the glutinous rice for 20-25 minutes or until translucent.","While the glutinous rice is cooking, cut the mangoes into small cubes and chill in the refrigerator until use.","In a sauce pan, heat up the coconut milk over low heat. Add in the salt and sugar. Keep stirring until the sugar dissolved. Remove from the heat. Pour out 1/4 cup of the coconut milk and reserve for serving.","When the glutinous rice is cooked, transfer it in to a bowl. Pour the rest of the coconut milk into the bowl and mix it with the glutinous rice. Keep stirring until it becomes a thick porridge consistency. Slowly, the rice will absorb all the coconut milk. Leave it to cool to room temperature.","Serve the sticky rice with the chilled mangoes. Drizzle the reserved coconut milk over the rice and top it with some toasted sesame seeds."]},
    {"title":"Leaf-Wrapped Salad Bites (miang kham) Recipe","summary":"Miang Kham, or betel leaf-wrapped salad bites, one of my favorite Thai recipes.","img":"https://rasamalaysia.com/wp-content/uploads/2014/04/leafwrappedsaladbites_thumb.jpg","time":"","ingredients":["1 tablespoon meaty dried shrimp","½ cup hot water","1 stalk lemongrass","½ cup plus 2 tablespoons unsweetened dried coconut flakes","1 shallot about 1 ounce, peeled and sliced thinly against the grain","2 1/4-inch-thick slices galangal, coarsely chopped","2 tablespoons coarsely chopped peeled ginger","1 tablespoon shrimp paste","½ cup packed grated palm sugar plus 1/3 cup packed dark brown sugar or substitute 2/3 cup packed dark brown sugar","1 tablespoon fish sauce","¼ cup water","2 tablespoons finely chopped roasted peanuts","1 lime","1 3-inch piece fresh ginger, peeled and cut into ¼-inch dice","2 shallots about 1 ounce each, peeled and cut into ¼-inch dice","½ cup roasted peanuts","5 or 6 fresh bird’s-eye chilies sliced crosswise ¼ inch thick","1/3 cup meaty dried shrimp","20 to 30 cha-plu leaves or 3-inch squares collard green or Chinese broccoli leaves"],"instructions":["To make the sauce, soak the dried shrimp in hot water for 15 minutes. Meanwhile, trim off and discard the leafy parts of the lemongrass stalk, remove the tough outer leaves of the bulb portion until the smooth, pale green core is exposed, and trim off the root end. Working from the root end, cut the bulb crosswise into paper-thin slices, stopping once you reach the point at which the purple rings disappear. Set the slices aside and discard the remainder.","Put the dried coconut flakes in a wok or 14-inch skillet and toast them on medium heat, stirring constantly, until medium brown, about 2 to 3 minutes. Reserve 2 tablespoons of the toasted coconut flakes for the sauce and set the remainder aside for the salad. Wipe out any toasted coconut sediment from the wok. Add the lemongrass slices, shallot, galangal, and ginger to the clean wok, then toast over medium-high heat, stirring constantly, until fragrant and the shallot slices are dry to the touch, about 5 minutes. Place the toasted mixture, drained dried shrimp, and shrimp paste in a mortar or a mini chopper and grind to a smooth paste.","Put the prepared paste, sugars, fish sauce, and water in a 1-quart saucepan and bring to a boil over medium-high heat, stirring constantly. When the sauce has thickened and reduced to about 1 cup, after 2 to 3 minutes, take the saucepan off the heat. Let the sauce cool completely. Once the dressing is cooled, stir in the chopped peanuts and the reserved 2 tablespoons toasted coconut flakes and transfer to a small serving bowl.","To prepare the salad, quarter the lime lengthwise and trim away the core. Cut the quarters into 1⁄4-inch dice, leaving the rind intact. Alternatively, for those who are sensitive to the bitterness of the lime rind, cut the lime into wedges (as shown in the photograph) and invite diners to squeeze about 1⁄2 teaspoon lime juice onto each composed salad bite.","Arrange the lime, ginger, shallots, peanuts, chiles, dried shrimp, cha-phlu leaves, and the dressing on a large serving platter.","To eat, put a leaf on your palm, add a bit of each component to the center of the leaf, top with a small spoonful of dressing, gather up the corners of the leaf to form a bag, and eat the whole thing in one bite."]},
    {"title":"Thai Pineapple Fried Rice Recipe","summary":"Thai Pineapple fried rice - amazing fried rice recipe with pineapple, shrimp and cashew nuts. Easy recipe that takes only 20 mins | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2009/12/pineapple-fried-rice-thumb.jpg","time":"Total Time 20 minutes","ingredients":["2 tablespoons oil","2 cloves garlic minced","1 teaspoon shrimp paste optional","4 oz shrimp shelled and deveined","8 oz leftover and overnight steamed rice","4 oz fresh pineapple cut into small pieces","1/2 red or green chili finely sliced, optional","1 tablespoon fish sauce","1/4 teaspoon dark soy sauce","2 tablespoons cashew nuts","Cilantro for garnishing"],"instructions":["Heat up a wok and add cooking oil. Stir-fry the garlic, and shrimp paste (if using) until aromatic. Add shrimp and stir-fry until half-cooked. Add rice, pineapple pieces, chili (if using) and do a few quick stirs. Add fish sauce and dark soy sauce to blend well with rice. Stir-fry for another minute or so, add the cashew nuts, stir to combine well, dish out, garnish with cilantro and serve immediately."]},
    {"title":"Thai Spicy Chicken Wings (Peek Gai Nam Daeng) Recipe","summary":"Spicy Thai Chicken Wings - Thai-version of buffalo wings, easy, quick, delicious and the taste is out of this world | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/01/spicy-thai-chicken-wings-thumb.jpg","time":"Total Time 50 minutes","ingredients":["Oil for frying","2 pounds chicken wings","Salt to taste","1/2 cup tapioca starch","2 tablespoons peanut oil","3 cloves garlic minced","2 small shallots minced","1 small onion minced","2 medium tomatoes cored and finely chopped","1 cup ketchup","2 tablespoons Sriracha or any Asian hot sauce","2 tablespoons soy sauce","2 tablespoons sugar","1 tablespoon oyster sauce","1/4 cup water","1 tablespoon Chinese cooking wine","1/4 cup roasted peanuts chopped","Celery Sticks","Cilantro leaves"],"instructions":["Pour enough oil in a 6-quart Dutch oven, about 1.5-2 inches high. Heat it at medium heat until the temperature reaches approximately 400°F (200°C).","In a bowl, season the chicken wings with salt to taste. Add in the tapioca starch and toss to coat.","When the oil is ready for frying, working in batches, slowly add the chicken wings to the oil. Cook, turning occasionally, until the chicken wings are golden brown and crisp, about 10-12 minutes. Transfer the chicken wings to a rack over a baking sheet to drain.","In a 6-quart sauce pan, heat the peanut oil over medium heat. Add in the garlic, shallots and onion. Stir well until the ingredients turn brown.","Then add in the tomatoes and cook while stirring until soft and smooth. Add in the ketchup, Sriracha, soy sauce, sugar, oyster sauce and water. Stir until it slightly thickens. Then add in the wine and give it a quick stir. Add the chicken wings to the sauce and toss to coat.","Transfer the chicken wings to a serving plate, sprinkle the chopped peanut and serve with cilantro and celery on the side. If there's extra sauce, transfer into a bowl and serve it with the chicken wings."]},
    {"title":"Creamy Thai Coconut Chicken Soup Recipe","summary":"Creamy Thai Coconut Chicken Soup - easiest and fastest Thai coconut chicken recipe ever! Takes only 15 mins and dinner is ready!","img":"https://rasamalaysia.com/wp-content/uploads/2016/12/creamy-thai-coconut-chicken-soup-thumb.jpg","time":"Total Time 11 minutes","ingredients":["2 tablespoons oil","1 small onion quartered","2 lbs skinless and boneless chicken breast or chicken thighs cut into cubes","2 tablespoons Thai red curry paste Mae Ploy brand","1 red bell pepper cut into thick strips","6 slices galangal optional","6 kaffir lime leaves torn and bruised, optional","3 cups chicken broth","2 tablespoons fish sauce or salt to taste","1 heaping tablespoon sugar","3/4 cup coconut milk","2 1/2 tablespoons lime juice","Cilantro leaves"],"instructions":["Turn on the Saute mode on your Instant Pot. Add the onion and saute for 10 seconds before adding the chicken. Saute the chicken until the surface turns white. Add the Thai curry paste, bell peppers, galangal and kaffir lime leaves (if using), stir to mix well. Add the chicken broth, fish sauce and sugar. Cover the pot and select High pressure for 6 minutes.","When it beeps, turn to Quick Release. When the valve drops, remove the lid carefully, add the coconut milk and lime juice to the soup, stir to mix well. Top with cilantro and serve immediately."]},
    {"title":"Thai Baked Chicken Drumsticks Recipe","summary":"Thai Baked Chicken Drumsticks – juicy, tasty, moist chicken marinated with amazing Thai flavors and baked to golden perfection. So good! | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2015/09/thai-baked-chicken-drumpsticks-thumb.jpg","time":"Total Time 1 hour 10 minutes","ingredients":["1 3/4 lbs or 6 chicken drumsticks","2 tablespoons finely chopped cilantro stems","3 cloves garlic minced","Chopped cilantro leaves for garnishing","Thai sweet chili sauce for dipping","1 tablespoon oil","1 3/4 tablespoons fish sauce","2 tablespoons coconut milk","1 tablespoon honey or Thai palm sugar","3 dashes ground black pepper","Pinch of cayenne pepper","Pinch of turmeric powder"],"instructions":["Preheat oven to 375F.","Rinse the chicken and pat dry with paper towels. Combine all the ingredients in Marinade, whisk to mix well to form a nice milky pale yellow mixture.","Add the cilantro and garlic to the chicken, rub onto the chicken drumsticks with your hand. Add the Marinade to the chicken, mix to coat well and marinate for 30 minutes or best for two hours.","Arrange the chicken on a cookie sheet lined with parchment paper, bake for 40 minutes or until the chicken is cooked through. Garnish with chopped cilantro and serve immediately with Thai sweet chili sauce."]},
    {"title":"Shrimp Pad Thai Recipe","summary":"Shrimp Pad Thai – easiest and best Pad Thai recipe with shrimp. This homemade Thai fried noodle is better and healthier than takeout.","img":"https://rasamalaysia.com/wp-content/uploads/2009/10/pad-thai-thumb.jpg","time":"","ingredients":["8 oz dry skinny rice sticks","2 tablespoons oil","2 cloves garlic minced","8 oz shelled and deveined shrimp","2 oz fried tofu cut into pieces","2 eggs lightly beaten","6 oz bean sprouts","1 oz chives or scallion cut into 2-inch lengths","2 tablespoons tamarind","1/3 cup warm water","3 1/2 tablespoons fish sauce","4 tablespoons tamarind juice or 3 tablespoons Chinese rice vinegar or apple cider vinegar","1 1/2 teaspoons chili powder","2 1/2 tablespoons sugar","3 tablespoons water"],"instructions":["Cook the skinny rice sticks according to the package directions. Strain in a colander and run cold running water until the noodles becomes cool. Set aside to drain.","Make the Tamarind juice by adding the tamarind and water together.  Use your hand or a spoon to massage and squeeze the tamarind pulps to release the flavor. The tamarind juice should be dark brown in color, and slightly thick in its consistency. Extract 4 tablespoons of juice, set aside. Discard the tamarind pulps.","Mix all the ingredients for the Sauce in a small bowl. Set aside.","Heat the oil in a wok or skillet over high heat. Add the garlic and stir fry until aromatic. Add the shrimp, tofu, and continue stirring. As soon as the shrimp changes color, add the rice sticks and stir continuously, for 30 seconds. Use the spatula to push all the ingredients to one side of the wok or skillet. Add the eggs and let cook for about 1 minute or until the bottom sets. Fold the noodles over the eggs, and then add in the Sauce. Stir continuously until everything is well combined. Add the bean sprouts, chives and do a few quick stirs. Turn off the heat and serve the noodles immediately with the lime wedges and topped with the peanuts."]},
    {"title":"Tom Kha Gai (Thai Coconut Chicken Soup)","summary":"Tom Kha Gai hai -  BEST and EASIEST recipe for Thai coconut chicken soup with chicken, mushroom and coconut milk. 20 mins and better than restauarant's.","img":"https://rasamalaysia.com/wp-content/uploads/2013/12/tom-kha-gai-thumb.jpg","time":"Total Time 20 minutes","ingredients":["8 oz boneless and skinless chicken breast or thighs, cut into strips or thin pieces","20 canned straw mushrooms","1 1/2 cups coconut milk","1 cup water","1 stalk lemongrass cut into 3-inch lengths and pounded","6 kaffir lime leaves lightly bruised to release the flavor","6 slices galangal","8 bird's eye chilies lightly pounded","3 tablespoon fish sauce","2 1/2 tablespoons lime juice or to taste","1 tablespoon chopped cilantro"],"instructions":["Add water, lemongrass, galangal, chilies, kaffir lime leaves into a pot and bring it to boil. Add straw mushrooms and chicken and boil it on medium heat for a few minutes or until the chicken is cooked through. Add coconut milk and boil for a couple more minutes. Turn off the heat and add lime juice and fish sauce to taste. Add chopped cilantro before serving."]},
    {"title":"Thai Shrimp Cake Recipe","summary":"Thai Shrimp Cake - best Thai shrimp cake recipe loaded with shrimp, red curry, long beans and served with sweet chili sauce. So good!","img":"https://rasamalaysia.com/wp-content/uploads/2012/05/thai-shrimp-cake-thumb.jpg","time":"Total Time 17 minutes","ingredients":["8 oz 250g peeled and deveined raw shrimp, roughly chopped","2 tablespoons red curry paste","1 large egg","2 teaspoon fish sauce","1 tablespoon sugar","2 tablespoons coconut milk","1/4 cup 25g chopped long bean/green beans","2 tablespoons roughly chopped Thai basil leaves","2 tablespoons oil","1/4 cup 65ml Thai sweet chili sauce","1 tablespoon fresh lime juice","2 teaspoon chopped coriander leaves cilantro","1 teaspoon minced ginger"],"instructions":["Prepare the Sweet Cilantro Sauce by whisking all the ingredients together in a small bowl and then set aside.","Spread the shrimp on a plate and chill the shrimp in the freezer for 15 minutes(this can ensures the springy texture of the shrimp cakes). Meanwhile get all your other ingredients ready. Combine the chilled shrimp, red curry paste, egg, fish sauce, sugar and coconut milk in a food processor or blender. Process until smooth, about 30 seconds. Transfer the mixture to a mixing bowl. Mix in the green beans and basil.","Because different brands of curry pastes have differing amounts of salt you'll want to make a sample shrimp cake first by saute 1 tablespoon of the mixture in a skillet(frying pan). Taste, and if necessary, adjust the seasoning with fish sauce and salt.","Heat a large skillet over medium heat. First use 1 tablespoon of the oil to coat the skillet, use a measuring spoon to drop 1 tablespoon of the paste into the skillet. With a damp finger, flatten the paste slightly to about 1/2\" thick. Make about 10 of these shrimp patties in the skillet.Cook the cakes until they are golden brown on each side and cooked through, about 2 minutes per side. Wipe out the skillet with a paper towel, make more patties from the remaining paste and cook the same way. Serve with a side bowl of the Sweet Chili Sauce."]},
    {"title":"Pad See Ew Recipe","summary":"Pad See Ew - popular Thai rice noodles with chicken and vegetables. Easiest and best homemade pad see ew recipe, much better than restaurants and takeouts.","img":"https://rasamalaysia.com/wp-content/uploads/2009/11/pad-see-ew-thumb.jpg","time":"Total Time 20 minutes","ingredients":["2 tablespoons oil","2 cloves garlic minced","4 oz boneless and skinless chicken breast cut into thin pieces","8 oz dry wide rice sticks or 10 oz fresh flat rice noodles","6 oz Chinese broccoli kalian/gailan","2 beaten eggs optional","2 tablespoons sweet soy sauce","1 tablespoon fish sauce","1 tablespoon oyster sauce","1 tablespoon sugar"],"instructions":["Cook the wide rice sticks according to the package directions. Strain in a colander and run cold running water until the noodles becomes cool. Set aside to drain. If you use fresh flat rice noodles, loosen the noodles with hand, make sure they are not sticking or clumping together.","Mix all the ingredients for the Seasonings in a small bowl. Set aside.","Heat the oil in a wok or skillet over high heat. Add the garlic and stir fry until aromatic. Add the chicken and continue stirring. As soon as the chicken changes color, add the rice noodles, Chinese broccoli, and stir continuously, for 30 seconds. Add the Seasonings and stir continuously until everything is well combined. Add the beaten eggs (if using), and more oil if needed. Cook the egg and then stir to combine well with the noodles.  Dish out and serve immediately."]},
    {"title":"Thai Basil Squid Recipe","summary":"Thai basil squid is a popular Thai recipe using squid, basil leaves, and roasted chili paste. Easy recipe that takes only 30 minutes and tastes delicious.","img":"https://rasamalaysia.com/wp-content/uploads/2012/09/basil_squid_thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 tablespoon oil","3 tablespoons Nam prik phao or Thai roasted chili paste","3 bird's eyes chilies lightly pounded","12 oz squid cleaned and cut into rings, and pat dry with paper towels","1 teaspoon fish sauce or to taste","1 tablespoon lime juice","A big handful Thai basil leaves stems removed"],"instructions":["Heat up a wok with the oil. Add the roasted chili paste and bird's eye chilies and stir fry until you smell the spicy aroma. Add the squid into the wok and stir to combine well. Add the fish sauce and lime juice. Stir a few times before adding the basil leaves. As soon as the leaves are wilted and the squid completely cooked, dish out and serve immediately with rice."]},
    {"title":"Jungle Curry Recipe","summary":"Jungle curry is a popular Thai curry. Jungle curry is spicy, with no coconut milk. You can make pork or chicken jungle curry with this easy recipe.","img":"https://rasamalaysia.com/wp-content/uploads/2012/10/jungle-curry-with-pork-thumb.jpg","time":"Total Time 28 minutes","ingredients":["1 cup 250 ml water","1 pack 1.76 ounce/50g red curry paste (see picture below)","2-3 slices galanga 1/4 inch thick","1 teaspoon rhizome optional","1 pound pork sliced thinly","2 tablespoons fish sauce","1 teaspoon sugar","1/2 cup canned bamboo shoot","1/2 cup canned baby corn","1/2 cup canned straw mushroom","8-10 string beans cut in to 2\" length","6 kaffir leaves","15 basil leaves"],"instructions":["Heat up a wok and add in the water, red curry paste, galanga and rhizome (optional). Stir to combine until boiling.","Add the pork and let it cook for 1 minute. Add the fish sauce and sugar. Stir to mix. Gently transfer the bamboo shoot, baby corn, straw mushroom, string beans and kaffir leaves into the wok. Stir to mix.","Cover the wok and bring to boil. Turn the heat to medium and let it cook for 5-6 minutes. Add in the basil leaves. Give it a quick stir and cook for 2 minutes. Serve with rice."]},
    {"title":"Tom Yum Noodle Soup Recipe","summary":"15-Minute Tom Yum Noodle Soup - not packaged ramen, but made from scratch, super EASY Thai Tom Yum Ramen. So GOOD!","img":"https://rasamalaysia.com/wp-content/uploads/2012/08/tom_yum_noodles_thumb.jpg","time":"","ingredients":["1 roll packaged soba noodles/egg noodles or instant noodles","1 1/4 cups water","1 stalk lemongrass white part only, pounded and bruised","5-6 kaffir lime leaves bruised","4-5 slices fresh galangal","1/2 small tomato cut into 3 to 4 wedges","6 medium-sized shrimp shelled and deveined","6 canned straw mushrooms or fresh oyster mushrooms cut into halves","1 1/2 tablespoons Nam Prik Pao Thai roasted chili paste","1/2 tablespoon fish sauce or to taste","3 dashes chili powder","1 1/2 tablespoons lime juice","Cilantro leaves for garnishing"],"instructions":["Prepare the soba/egg noodles according to package instructions. Usually it takes about 5 minutes or so to cook the soba noodles. Drain the noodles, rinse with cold water and set aside in a serving bowl.","At the same time, bring the 1 1/4 cups water to boil in another small pot. Add in all the aromatics, follow by the shrimp, mushrooms, and nam prik phao. Keep boiling until the shrimp is cooked through. Add the fish sauce and chili powder. Turn off the heat, add in the lime juice. Stir to combine well.","Pour the Tom Yum soup over the noodles and topped with some cilantro leaves. Serve immediately."]},
    {"title":"Thai Chicken Lettuce Wraps Recipe","summary":"Thai Chicken Lettuce Wraps – easy, healthy and delicious chicken wraps with Thai sweet chili sauce. Takes 20 mins to make!","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/thai_chicken_lettuce_wraps_thumb.jpg","time":"Total Time 20 minutes","ingredients":["2 tablespoons oil","1/4 small onion finely diced","3 cloves garlic minced","10 oz ground chicken","1/2 cup 6 tablespoons whole roasted cashew nuts","1 tablespoon fish sauce","1 tablespoon soy sauce","1 tablespoon chopped cilantro leaves","1 head butter lettuce","3 tablespoons Thai sweet chili sauce","2 teaspoons lime juice","1 tablespoon chopped cilantro leaves","Pinch of white sesame seeds"],"instructions":["Mix all the ingredients for the Sauce in a small bowl, stir to combine well. Clean the butter lettuce, peel each leaf off the stem, set aside.","Heat up a wok or skillet on medium heat and add the oil. When the oil is heated, add the onion, garlic, and stir-fry until they are slightly browned. Add the ground  chicken, stir continuously with the spatula, break up the lumps. Add the cashew nuts, fish sauce, and sweet soy sauce. Stir to combine well.","Continue to cook until the filling becomes dry but remains moist. Add the cilantro and turn off the heat.","To assemble the lettuce wraps, add 1 tablespoon of the filling onto the middle of the butter lettuce, and top with some sauce. Wrap it up and eat immediately."]},
    {"title":"Thai Cucumber Salad Recipe","summary":"Thai Cucumber Salad - easiest and best homemade Thai cucumber salad recipe that is better than your favorite Thai restaurants, guaranteed.","img":"https://rasamalaysia.com/wp-content/uploads/2016/08/thai-cucumber-salad-thumb.jpg","time":"","ingredients":["1 lb cucumber cut into pieces","1/4 teaspoon salt","1/4 small red onion sliced","2 tablespoons chopped roasted peanuts","1 tablespoon chopped cilantro","2 tablespoons sugar","2 tablespoons water","4 tablespoons Thai sweet chili sauce","1 tablespoon Apple cider vinegar"],"instructions":["Add salt to the cucumber, mix well and set aside in the fridge for 10-15 minutes. In the meantime, make the Dressing, by combining all the ingredients in a small sauce pan. Turn on the heat and reduce the Dressing a bit so it's slightly thickened. Let cool.","Drain the salt water from the cucumber completely. Toss the cucumber, onion, and mix with the Dressing. Top with the peanut and cilantro, serve immediately."]},
    {"title":"Chicken Pad Thai Recipe","summary":"Chicken Pad Thai - quick and easy Pad Thai with chicken. Learn how to make this amazing Thai stir-fried noodles with a sweet and savory homemade Pad Thai sauce. It's so good you don't need another takeout again | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2018/03/chicken-pad-thai-thumb.jpg","time":"Total Time 20 minutes","ingredients":["8 oz dry skinny rice sticks or Pad Thai Noodles","2 tablespoons oil","2 cloves garlic minced","8 oz skinless and boneless chicken breast sliced","2 oz fried tofu cut into pieces","2 eggs lightly beaten","8 oz bean sprouts","1 stalk scallion cut into 2-inch lengths","1 tablespoon crushed roasted peanuts","1 lime cut into wedges","3 1/2 tablespoons fish sauce","3 tablespoons Chinese rice vinegar preferred or apple cider vinegar","1 1/2 teaspoons chili powder","2 1/2 tablespoons sugar","3 tablespoons water"],"instructions":["Cook the skinny rice sticks according to the package directions. Strain in a colander and run cold running water until the noodles becomes cool. Set aside to drain.","Make the Pad Thai Sauce by mixing all the ingredients together. Set aside.","Heat the oil in a wok or skillet over high heat. Add the garlic and stir fry until aromatic. Add the chicken, tofu, and continue stirring. As soon as the chicken changes color, add the rice sticks and stir continuously, for 30 seconds. Use the spatula to push all the ingredients to one side of the wok or skillet. Add the eggs and let cook for about 1 minute or until the bottom sets. Fold the noodles over the eggs, and then add in the Sauce. Stir continuously until everything is well combined. Add the bean sprouts, scallions and do a few quick stirs. Turn off the heat and topped the noodles with the crushed peanuts. Serve the noodles immediately with the lime wedges."]},
    {"title":"Thai Red Curry Recipe","summary":"Thai Red Curry - delicious, authentic and easy red curry with chicken and scallops. Homemade red curry is so easy to make! It takes only 20 minutes and much cheaper than eating out.","img":"https://rasamalaysia.com/wp-content/uploads/2018/03/red-curry-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 tablespoon oil","1 1/2 tablespoons red curry paste I used Mae Ploy red curry paste","4 oz. big scallops","4 oz. boneless and skinless chicken breast cut into small cubes","80 ml. coconut milk","1/4 cup water","2 long beans cut into 2-inch lengths","1/2 cup thickly sliced carrot","1 kaffir lime leave cut into fine thin strips, optional","1/4 teaspoon fish sauce","2 teaspoons palm sugar or sugar"],"instructions":["Heat up a small pot with the cooking oil. Saute the red curry paste until aromatic.  Add the scallops and chicken into the pot and stir well with the curry paste. Add coconut milk, water, long beans, carrots, kaffir lime leaves, and bring the curry to boil. Add fish sauce, palm sugar, and stir-continuously for 10 seconds or so, dish out and serve immediately with steamed jasmine rice."]},
    {"title":"Thai Beef Salad Recipe","summary":"Thai Beef Salad is a tasty salad with beef and greens in a savory dressing. Easy Thai beef salad recipe that everyone can make at home. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/09/Thai-Beef_Salad-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 lb/450 grams grilled top sirloin or trimmed rib eye steak","A tiny bit of cooking oil","1 cup spinach leaves","1/2 cup fresh mint leaves","1/2 cup fresh cilantro","2 thinly sliced shallots","6-8 cherry tomatoes cut in halves","1/4 cup lime juice or 5 tablespoons lime juice","1/4 cup or 5 tablespoons fish sauce","Sugar to taste","1- 2 red birds eye chilies finely chopped depending on how hot you like it"],"instructions":["Preheat a pan on high heat until very hot. Add a bit of cooking oil and spread it evenly across the bottom. Let the steak sit in the pan for around a minute to get a nice crust. Flip over the steak and repeat. Reduce heat to medium and cook to your liking. Wrap the meat in aluminum foil and allow resting for about 5 – 10 minutes before thinly slicing across the grain.","In a bowl whisk together fish sauce, lime juice, bird's eye chilies and sugar to taste. Toss in the mint leaves, cilantro, shallots and cherry tomatoes and mix well. Serve the salad mix on top of a bed of spinach and drizzle some of the dressing over."]},
    {"title":"Thai Cashew Chicken Recipe","summary":"Thai Cashew Chicken - best Thai chicken stir-fry with cashew nuts and bell peppers. So easy to make, takes 20 mins and much better than restaurants | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2017/03/thai-cashew-chicken-thumb.jpg","time":"Total Time 20 minutes","ingredients":["10 oz. boneless skinless chicken breast, cut into thin pieces","2 tablespoons oil","2 cloves garlic minced","1/2 small onion cut into pieces","1/2 small red bell pepper cut into pieces","1/2 small green bell pepper cut into pieces","3/4 cup whole cashew nuts","2 stalks scallion cut into strips","1 tablespoon soy sauce","1 1/2 tablespoons fish sauce","1 tablespoon sugar or more to taste","4 tablespoons water"],"instructions":["Mix all the ingredients in the Sauce together. Make sure the sugar is completely dissolved. Set aside.","Heat up a skillet with the oil on high heat. When the skillet is heated, add the chicken and cook until both sides turn slightly brown. Push the chicken to one side of the skillet and make sure that the other side has the oil.","Add the garlic and onion and saute for 30 seconds. Add the bell peppers and cashew nuts. Toss and stir fry with the chicken before adding the Sauce. Add the scallion, stir to combine well. Turn off the heat and serve immediately with steamed rice."]},
    {"title":"Thai Yellow Curry","summary":"Thai Yellow Curry – creamy yellow curry recipe loaded with chicken, zucchini and bell peppers. So easy and much better than takeouts.","img":"https://rasamalaysia.com/wp-content/uploads/2016/06/yellow-curry-thumb.jpg","time":"Total Time 20 minutes","ingredients":["2 tablespoons oil","1 1/2 tablespoons yellow curry paste","8 oz boneless and skinless chicken breast cut into bite-sized pieces","1/3 cup bamboo shoots","1/2 small zuchinni cut into rounds","1/2 small red bell pepper cut into pieces","1/3 cup coconut milk","3/4 cup water","1 teaspoon fish sauce","2 teaspoons sugar"],"instructions":["Heat the oil in a small pot over medium heat. Add the yellow curry paste. When you smell the aroma from the curry paste, add the chicken, bamboo shoots, zucchini and bell peppers into the pot, stir to combine well with the curry paste.","Add the coconut milk, water, and cover the pot with its lid. Let cook for about 3 minutes or until all the ingredients are cooked. Add the fish sauce, sugar, and stir to mix well with the curry. Turn off the heat and serve the curry immediately with steamed jasmine rice."]},
    {"title":"Thai Shrimp and Pineapple Curry Recipe","summary":"Thai Shrimp & Pineapple Curry - shrimp & pineapple are the best combos for this amazing and super delish curry. Takes 15 minutes to make | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/08/shrimp_pineapple_curry_thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 1/2 tablespoons oil","2 tablespoons Thai red curry paste store-bought","1/2 cup coconut milk","1/2 cup water","3 - 4 kaffir lime leaves slightly bruised, optional","8 oz shelled and deveined shrimp tail-on","1 cup pineapple cubes","1/2 tablespoon fish sauce","1/2 tablespoon sugar/palm sugar","A squirt of lime juice"],"instructions":["Heat up a pot with the cooking oil. When the oil is heated, add the curry paste and stir to release the aroma. Make sure to keep stirring and don't burn the curry paste. Add the coconut milk, water, and kaffir lime leaves and bring the curry to boil. All the prawn and pineapple and let cook for about 5 minutes on medium to low heat. Add the fish sauce, sugar, and lime juice, stir to combine well. Turn off the heat and serve immediately with steamed white rice."]},
    {"title":"Thai Coconut Chicken and Shrimp Soup Recipe","summary":"Thai Coconut Chicken and Shrimp Soup – the best soup you'll ever make in your kitchen. This soup is to-die-for, better than Thai takeout!","img":"https://rasamalaysia.com/wp-content/uploads/2015/11/thai-coconut-chicken-and-shrimp-soup-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 can 14.5 oz chicken broth (1 3/4 cups)","4 cups water","3 stalks lemongrass white part only, pounded","2- inch piece galangal sliced","12 kaffir lime leaves bruised","3 tablespoonsThai roasted chili paste nam prik pao","1/2 lb skinless chicken breast cut into cubes","1/2 lb shrimp shelled and deveined, tail-on","6 oz fresh white button mushrooms stems trimmed and quartered","1 red chilies deseeded, cut into thick strips","2 1/2 tablespoons fish sauce","3/4 cup coconut milk","1 big lime juiced"],"instructions":["Add the chicken broth and water into a pot on high heat. Add the lemongrass, galangal, kaffir lime leaves and roasted chili paste into the broth and bring to boil.","Add the chicken, shrimp, mushroom and red chili. When the chicken and shrimp are cooked, add fish sauce, coconut milk and lime juice. Stir to combine well. Turn off heat and serve immediately."]},
    {"title":"Yum Woon Sen (Thai Noodle Salad with Shrimp) Recipe","summary":"Thai Noodle Salad Yum Woon Sen - easy recipe of healthy Thai noodle salad with shrimp in a delicious lime and sweet chili dressing | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/yum_woon_sen_thumb.jpg","time":"Total Time 30 minutes","ingredients":["4 oz pre-soaked mung bean noodles glass noodles, cellophane noodles","8-12 medium-sized shrimp shelled and deveined","3 shallots thinly sliced","1/2 small tomato diced","1 tablespoon coarsely chopped cilantro leaves","1 tablespoon coarsely chopped mint leaves","2 tablespoons roasted cashew nuts or roasted peanuts, pounded","1 garlic fineley minced","1 1/2 tablespoons fish sauce","1 tablespoon sugar or to taste","2 tablespoons warm water","1 tablespoon lime juice or to taste","1 tablespoon Thai sweet chili sauce"],"instructions":["Dry mung bean noodles are very light. Soak the dry mung beans noodles with warm water for about 10 minutes (until soft). Discard the water, drain dry and set aside (use 4 oz of them for this recipe). Boil some water and add in the noodles and cook according to the package instruction (a couple of minutes or until the noodles are just cooked through but not mushy). Remove the noodles and drained. Using the same water, boil the shrimp until they are completely cooked. Remove and set aside.","Mix all the ingredients in the Dressing well (make sure the sugar is completely dissolved), set aside.","In a salad bowl, mix the mung bean noodles, shrimp, shallots, tomato, cilantro, mint with the Dressing. Toss to blend well. Add the roasted cashew nuts, stir to combine well. Serve immediately at room temperature or chill in the refrigerator for 30 minutes before serving."]},
    {"title":"Beef with Red Chili Paste and Lime Leaves Recipe","summary":"Beef with Red Chili Paste – This Beef and Red Chili Paste is from my friend Katie Chin’s new cookbook, Every Thai Cooking: Quick and Easy Family Style Recipes from Tuttle Publishing. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2018/10/beefwithchilipaste_thumb.jpg","time":"Total Time 32 minutes","ingredients":["10 oz 330 g beef tenderloin or top sirloin, sliced diagonally across the grain in ¼ in (6 mm) slices","½ teaspoon all-purpose cornstarch","¼ teaspoon white pepper","1 teaspoon + 2 tablespoons high-heat cooking oil divided","1 teaspoon soy sauce","1 garlic clove minced","1 small shallot ﬁnely sliced","1 fresh hot red or green chili preferably Thai (deseeded if you prefer less heat), ﬁnely sliced","1 small red bell pepper thinly sliced","1 tablespoon freshly squeezed lime juice","1 tablespoon fish sauce nam pla","1 tablespoon Roasted Red Chili Paste or store-bought(nam pla, optional)","2 kafﬁr lime leaves cut into thin strips (optional)","2 teaspoons palm or brown sugar","¾ cup 15 g fresh Thai or Italian basil leaves","4 tablespoons high-heat cooking oil , divided","6 garlic cloves minced","6 tablespoons ﬁnely chopped shallots","1 tablespoon ground red pepper cayenne","4 teaspoons fermented shrimp paste","2 tablespoons fish sauce nam pla","3 tablespoons palm or brown sugar","1 tablespoon freshly squeezed lime juice","1 teaspoon tamarind concentrate","1 tablespoon water"],"instructions":["Toss the beef with the all-purpose cornstarch, pepper, 1 teaspoon oil, and soy sauce. Cover for 10 minutes at room temperature.","Heat ½ of the oil in a wok or skillet over medium-high heat. Add the beef and stir-fry until it's brown, about 3 minutes. Remove the beef from the pan and set aside. Wash and thoroughly dry the wok or skillet.","Heat the remaining oil in the wok or skillet over medium-high heat. Add the garlic, shallots, and chili to the wok or skillet and stir-fry until fragrant, about 1 minute. Add the red pepper and stir-fry for 1 minute. Add the reserved beef, lime juice, ﬁsh sauce, roasted red chili paste (if using), kaffir lime leaves (if using), and palm sugar; stir-fry for 1–2 minutes or until the beef is cooked through. Add the basil leaves and stir-fry for about 30 seconds or until wilted. Dish out and serve immediately with jasmine rice.","Heat the oil in a wok or skillet at medium high heat. Add the garlic and shallots and stir-fry until fragrant, about 30 seconds. Transfer garlic and shallots to a small bowl with a slotted spoon. Set aside. Leave the remaining oil in the pan.","Combine the ground red pepper, shrimp paste, ﬁsh sauce, brown sugar, lime juice, tamarind concentrate, water, reserved garlic, and shallots in a small food processor. Pulse until a thick paste forms.","Return the paste to the wok or skillet and stir it into the oil over low heat. Simmer gently and continue stirring until the mixture is a smooth, oily, and shimmering paste."]},
    {"title":"Thai Sweet Chili Peanut Noodles Recipe","summary":"Thai Sweet Chili Peanut Noodles – quick noodles with a creamy and spicy Thai peanut sauce. Four ingredients and 15 minutes to make.","img":"https://rasamalaysia.com/wp-content/uploads/2016/09/thai-sweet-chili-peanut-noodles-thumb.jpg","time":"Total Time 15 minutes","ingredients":["8 oz spaghetti","3 tablespoons creamy peanut butter","3 tablespoons Thai sweet chili sauce","1 1/2 tablespoons Apple cider vinegar","Chopped peanut or cashew nuts","Cilantro leaves for garnishing","Lime wedges"],"instructions":["Cook the spaghetti according to package instructions. Drain after cooking.","Add the peanut butter, sweet chili sauce and apple cider vinegar in a small sauce pan. Heat up on low heat, stir and mix well. In a mixing bowl, toss the spaghetti with the peanut sauce. Top with the peanut or cashew nuts and cilantro, serve immediately."]},
    {"title":"Zucchini and Chicken Curry","summary":"Zucchini and chicken pair well in this Thai red curry. Easy and delicious zucchini and chicken curry that you can make at home with simple ingredients.","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/zucchini_chicken_curry_thumb.jpg","time":"Total Time 15 minutes","ingredients":["1 tablespoon oil","1 1/2 tablespoons red curry paste","8 oz boneless and skinless chicken breast cut into cubes","6 baby carrots","6 oz zucchini cut into quarters","80 ml coconut milk","1/4 cup water","2 teaspoons palm sugar or white sugar to taste","1/2 teaspoon fish sauce"],"instructions":["Heat up a skillet with the oil. Saute the red curry paste until aromatic.","Add the chicken and carrots into the pot and stir well with the curry paste.","Add the zucchini, coconut milk, water and bring the curry to boil, about 5 minutes. Add the palm sugar and fish sauce and let boil for another minute or so, or until the zucchini is a bit soft but not overcooked. Dish out and serve immediately with steamed jasmine rice."]},
    {"title":"Sweet Thai Chicken Wings Recipe","summary":"Sweet Thai Chicken Wings - perfectly grilled chicken wings with sweet Thai seasoning. Crazy delicious wings you can't stop eating.","img":"https://rasamalaysia.com/wp-content/uploads/2016/07/sweet-thai-chicken-wings-thumb.jpg","time":"Total Time 30 minutes","ingredients":["2 lbs chicken wings","5 cloves garlic minced","2 tablespoons cilantro stems without leaves","5 tablespoons fish sauce","4 tablespoons Thai sweet chili sauce","1 teaspoon ground black pepper","Lime wedges"],"instructions":["Rub the chicken wings with the garlic and cilantro, then add the fish sauce, sweet chili sauce and ground black pepper. Marinate for two to four hours, or best overnight.","Fire up an outdoor grill and grill the chicken wings in batches. Grill until both sides turn golden brown. Serve immediately with some lime wedges and Thai sweet chili sauce."]},
    {"title":"Thai Shrimp Noodle Soup","summary":"Thai Shrimp Noodle Soup – quick and easy Thai noodles made with ramen. Loaded with shrimp, mushrooms, herbs, tomatoes and mouthwatering Thai Tom Yum soup. So good!","img":"https://rasamalaysia.com/wp-content/uploads/2018/04/thai-shrimp-ramen-thumb.jpg","time":"Total Time 15 minutes","ingredients":["2 packages instant ramen noodles","2 1/2 cups water","2 stalks lemongrass white part only, pounded and bruised","6 kaffir lime leaves bruised","5 slices fresh galangal","1 to mato cut into wedges","6 oz medium-sized shrimp shelled and deveined","2 oz white mushrooms cut into pieces","3 tablespoons Nam Prik Pao Thai roasted chili paste","1 tablespoon fish sauce or to taste","1/4 cup canned evaporated milk","3 tablespoons lime juice","Cilantro leaves for garnishing"],"instructions":["Prepare the ramen noodles according to package instructions. Discard the seasoning packets. Cook to al dente, rinse with cold water and set aside.","At the same time, bring the water to boil in another pot. Add the lemomngrass, kaffir lime leaves, galangal and bring it to boil, 1 minute. Add the tomatoes, shrimp, mushrooms, and nam prik phao. Keep boiling until the shrimp is cooked through. Add the fish sauce and evaporated cream. Turn off the heat, add the noodles and lime juice. Stir to combine well. Garnish with the cilantro leaves. Serve immediately."]},
    {"title":"Beef Massaman Recipe","summary":"Beef Massaman Curry - crazy delicious Thai beef massaman curry. Learn how to make massaman curry with this easy and fail-proof recipe.","img":"https://rasamalaysia.com/wp-content/uploads/2008/11/beef-massaman-thumb.jpg","time":"Total Time 1 hour 45 minutes","ingredients":["1 1/2 pounds cubed chuck beef or stewing beef","3 tablespoons Massaman curry paste","10 green cardamom seeds","2 cinnamon sticks","3 star anise","8 small shallot onions peeled","2 small cans 5.6 fl oz coconut milk","1 cup water","2 1/2 tablespoons fish sauce  or to taste","1 medium-sized potato peeled and cut into chunks","1/2 tablespoon tamarind paste","2 tablespoons palm sugar or brown sugar","4 tablespoons unsalted roasted peanuts","2 tablespoons cooking oil","A handful of fresh Thai basil leaves"],"instructions":["Coat beef in 1 tablespoon of oil and massaman curry paste. Stir well and set aside.","In a large pot, heat remaining oil over medium heat. Stir-fry the cardamom, cinnamon and star anise for 40 seconds. Add the whole shallots and fry until golden brown.","Add the beef and brown for 1-2 minutes. Stir to mix well with the spices.","Add 1 can of coconut milk, 2 tbsp of fish sauce and 1/2 to 1 cup of water until the beef is just covered by the liquid. Stir well and then bring to the boil. Once boiling, turn heat down very low and cover. Gently simmer for 1 hour.","Add the remaining can of coconut milk, potatoes, peanuts and half the basil leaves. Stir well. Taste and add a little more fish sauce if necessary.","Turn heat up to medium-low and cover. Cook for another 30 minutes or until potatoes are tender.","Once the potatoes are cooked, remove the curry from the heat. Stir in the palm sugar, tamarind juice and remaining basil. Stir well and serve the curry with steamed rice."]},
    {"title":"Northeast Minced Chicken Salad (Lap Kai) Recipe","summary":"Northeast Minced Chicken Salad from Simple Thai Food cookbook. | rasamalaysia.comReprinted with permission from Simple Thai Food by Leela Punyaratabandhu, copyright (c) 2014. Published by Ten Speed Press, a division of Penguin Random House, Inc. Photography (c) 2014 by Erin Kunkel.","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/northeastmincedchickensalad_thumb.jpg","time":"","ingredients":["1 1/4-inch thick slice galangal, minced (optional)","2 large shallots about 1 ounce each, sliced lengthwise paper-thin","2 tablespoons red chile powder","1 ½ tablespoons fish sauce","3 tablespoons freshly squeezed lime juice","12 ounces ground chicken","1/3 cup water","2 teaspoons toasted rice powder","10 blades fresh sawtooth coriander coarsely chopped, or ½ cup fresh cilantro leaves","½ cup loosely packed fresh mint leaves","3 or 4 1-inch-wide wedges green cabbage"],"instructions":["Place a dry wok or 14-inch skillet over medium-low heat, add the galangal, and toast, stirring constantly, until dry to the touch and fragrant, which should take about 1 minute. Transfer to a bowl.","Add the shallots, chile powder, fish sauce, and lime juice to the bowl with the galangal, stir to mix, and set aside.","Return the pan to medium heat. When the pan is hot, add the chicken and water and cook, stirring and breaking up the meat with the edge of the spatula, just until the chicken is cooked through, about 5 to 8 minutes. Transfer the chicken and its juices to the bowl with the dressing.","Stir everything together well, then taste to see if the seasoning needs correcting. The salad should be predominantly sour, then salty. Adjust the seasoning as needed. When the salad tastes right, stir in the rice powder, sawtooth coriander, and mint. Serve immediately with the cabbage on the side."]},
    {"title":"Thai Chili Beef Burger Recipe","summary":"Thai Chili Beef Burger – Thai Chili Beef Burger. Try this and you might want to make it every day! | rasamalaysia.co","img":"https://rasamalaysia.com/wp-content/uploads/2013/06/thai-chili-beef-burgers-thumb.jpg","time":"Total Time 22 minutes","ingredients":["1 pound ground beef","1 tablespoon Thai red curry paste","1/2 cup bread crumbs","2 tablespoons chopped cilantro","1 egg lightly beaten","1 tablespoon light soy sauce","1/8 teaspoon freshly ground black pepper","1 baguette","2 cups shredded lettuce","Sweet chili sauce"],"instructions":["In a bowl, combine the ground beef with the red curry paste, bread crumbs, chopped cilantro, egg, light soy sauce and black pepper. Mix the ingredient together with your hand until sticky.","Divide into 8 portions and shape into mini burger patties.","Heat up the grill and cook this over high heat for 4-5 minutes on each side, or until cooked through.","Cut the baguette (lengthwise) into 4. Assemble each with 2 cooked mini burger patties, shredded lettuce and a little sweet chili sauce. Serve warm."]},
    {"title":"Thai Crab Fried Rice Recipe","summary":"Thai Crab Fried Rice – Crab fried rice is a tasty Thai-style fried rice dish with rice, eggs, and crab meat. Easy crab fried rice recipe that anyone can make at home. | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2013/07/crab_fried_rice_thumb.jpg","time":"Total Time 30 minutes","ingredients":["2 1/2 tablespoons oil","2 garlic finely minced","2 cups tightly packed overnight rice","1 1/2 tablespoons fish sauce","1 1/2 tablespoons light soy sauce","2 eggs lightly beaten","4 - 6 oz freshly picked crab meat preferred or frozen crab meat","3 dashes white pepper","3 scallions cut into small rounds","Cilantro leaves for garnishing","Lime wedges","Cucumber slices","Tomato wedges","3 bird's eye chilies Thai chilies, cut into small pieces","1 tablespoon fish sauce"],"instructions":["Loosen the overnight rice with your hand or a spoon so there are no lumps. Combine the cut chilies and fish sauce in a small saucer. Set aside.","Heat up a wok on high heat. When the wok is fully heated, add 2 tablespoons oil. When the oil is fully heated, add the garlic and stir-fry until light brown or aromatic. Add the rice into the wok and use the spatula to toss and stir the rice around. Add the light soy sauce and fish sauce, continue to stir and combine well with the rice.","Use your spatula and push all the rice to one side of the wok. Add the remaining 1/2 tablespoon oil in the wok and add in the beaten eggs. Leave the eggs to cook and set a little bit. Use the spatula to fold the rice on top of the eggs. Wait for about 1 minute, and then continue to stir and break the eggs into smaller pieces and make sure that they are nicely distributed in the rice.","Stir-in the crab meat and continue to stir-fry. The crab meat might make the fried rice slightly wet. Continue to stir-fry the fried rice until the rice is slightly toasted and fluffy. Add the white pepper powder and scallions, stir a few times, dish out and garnish the crab fried rice with cilantro leaves, and serve with lime wedges, cucumber slices, tomato wedges, and the cut chilies in fish sauce."]},
    {"title":"Muu Sateh (Pork Satay) Recipe","summary":"Reprinted with permission from Pok Pok by Andy Ricker with J.J. Goode , copyright © 2013. Published by Ten Speed Press, a division of Random House, Inc.Photography credit: Austin Bush © 2013","img":"https://rasamalaysia.com/wp-content/uploads/2013/12/muusateh_thumb.jpg","time":"","ingredients":["36 wood skewers 8 inches or so each, soaked in tepid water for 30 minutes","A Thai granite mortar and pestle","A charcoal grill highly recommended, grates oiled","1 6-ounce piece pork back fat (highly recommended but optional)","2 pounds boneless pork loin cut into strips that are approximately 3 inches long, 1 inch wide, and 1/4 inch thick","11/2 teaspoons coriander seeds","Very small pinch cumin seeds","1 teaspoon kosher salt plus extra for seasoning the skewers","14 grams thinly sliced lemongrass tender parts only, from about 2 large stalks","1 14-gram piece peeled fresh or frozen (not defrosted) galangal, thinly sliced against grain","1 14-gram piece peeled fresh or frozen (not defrosted) yellow turmeric root, thinly sliced against grain","2 tablespoons granulated sugar","6 tablespoons sweetened condensed milk preferably Black & White or Longevity brand","1/2 teaspoon ground white pepper","1 cup unsweetened coconut milk preferably boxed","About 11/2 cups Naam Jim Sateh Peanut sauce, page 281","About 11/2 cups Ajaat Cucumber relish, page 283","About 6 thick slices Pullman or other thick-cut white bread lightly grilled or toasted, then quartered"],"instructions":["Put the fat in a small pot, add just enough water to cover, and set the pot over high heat. Bring the water to a rolling simmer, decrease the heat to maintain it, and cook until the opaque white fat has turned slightly translucent, about 5 minutes. Drain the fat, discarding the water, and cut it into approximately 3/4-inch squares that are about 1/4 inch thick.","Skewer one fat cube per skewer (discard any extras), pushing the cubes down to about 4 inches from the tip. Weave one skewer through the center of each strip of pork, exiting and entering several times, so the strip is fixed firmly to it and ends just below the tip of the skewer.","Combine the coriander and cumin in a small pan, set the pan over medium-low heat, and cook, stirring and tossing often, until the spices are very fragrant and the coriander seeds turn a shade or two darker, about 8 minutes. Let the spices cool slightly and pound them in a granite mortar (or grind them in a spice grinder) to a coarse powder. Combine the spice powder, condensed milk, lemongrass, galangal, turmeric, sugar, salt, pepper, and all but a few tablespoons of the coconut milk in a blender. Blend until smooth, then pour the marinade into a container, preferably a deep, narrow one. Swish the remaining coconut milk in the blender and pour it into the container.","Add the skewers to the container with the marinade so that the meat (not necessarily the fat) is submerged in the marinade. Let it sit for at least 30 minutes or up to 1 hour while you prepare the grill.","Prepare a grill, preferably charcoal, to cook over medium-high to high heat (see page 124). Or preheat a lightly oiled, large flat griddle over medium-high heat. Remove the skewers from the marinade, letting any excess drip back into the container. Season both sides of the pork with salt and cook in batches, if necessary, turning the skewers over once and moving them around to contain flare-ups, until the pork is just cooked through and the outsides are as charred as you like them, 3 to 6 minutes total.","Serve them right away (or cover loosely with foil for up to 15 minutes after grilling) alongside the peanut sauce, cucumber relish, and bread."]},
    {"title":"Beef Curry with Pumpkin Recipe","summary":"Pumpkin and Beef Curry – This Thai-style beef curry is amazingly delicious, with chunks of pumpkin in a mildly spicy and rich curry. SO YUMMY | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2012/10/beef-curry-with-pumpkin-thumb.jpg","time":"Total Time 33 minutes","ingredients":["1 1/2 tablespoons vegetable oil","1 pack 1.76 ounce/50g red curry paste see picture below","4 tablespoons plus 1 1/2 cups 350ml coconut milk","1 pound beef sliced thinly","1 1/2 tablespoons fish sauce","1 teaspoon sugar","1/4 teaspoon paprika powder","6 kaffir lime leaves","1 1/2 cups cubed pumpkin or Kabocha pumpkin"],"instructions":["In a small bowl, mix together the vegetable oil, red curry paste and 4 tablespoons coconut milk. Stir-fry the red curry paste mixture in a wok over medium heat until fragrant.","Add the beef and give a quick toss. Let it cook for about 1 minute and then add in the 1 1/2 cups coconut milk, fish sauce, sugar, paprika powder and kaffir leaves. Stir to mix.","Bring to a boil and then reduce the heat. Cook for 8-10 minutes. Add the pumpkin and cook for another 4-5 minutes. Serve with rice."]},
    {"title":"Green Beans with Peanut Sauce","summary":"","img":"https://rasamalaysia.com/wp-content/uploads/2014/09/green_bean_with_peanut_sauce_thumb.jpg","time":"Total Time 15 minutes","ingredients":["8 oz green beans","1 tablespoon oil","2 cloves garlic finely minced","Ground peanuts optional","1/2 cup creamy peanut butter","3/4 cup coconut milk","2 tablespoons Thai red curry paste","2 tablespoons apple cider vinegar","1 tablespoon sugar or to taste","2 tablespoons ground peanut","Salt to taste"],"instructions":["Cut off the top and bottom points of the green beans, rinsed and set aside.","Add all the ingredients of the Peanut Sauce in the saucepan. Use a whisk to quickly whisk all the ingredients together before transferring to a stove top to heat up on low heat. Continue to whisk the Peanut Sauce until all ingredients are well-combined.","As soon as the sauce starts to bubble, turn off the heat. (If you like the sauce more watery, you may add a little water to dilute it during the cooking process.) Transfer off the heat and set aside.","In a pan, add the oil and saute the garlic until light brown. Add the green beans and keep stirring until they are cooked. Transfer out to a serving plate and pour some Peanut Sauce on top of the green beans and topped with some ground peanuts and serve immediately."]},
    {"title":"Thai Chicken Sate with Peanut Sauce Recipe","summary":"Thai Chicken Sate with Peanut Sauce – Thai chicken sate with peanut sauce. Make these at home with this easy recipe-much cheaper, delicious, and you can have as many sticks as you want!","img":"https://rasamalaysia.com/wp-content/uploads/2015/05/thai_chicken_sate_thumb.jpg","time":"Total Time 50 minutes","ingredients":["2 pounds skinless and boneless chicken breast sliced 1 inch wide x 4-5 inches length","20 wooden skewers soaked in water for 30 minutes","1/2 cucumber sliced","2 tablespoons fish sauce","1.5 tablespoons minced garlic","2.5 teaspoons sweet soy sauce","2.5 teaspoons sugar","1/4 teaspoon white pepper","1/2 teaspoon turmeric powder","1/2 teaspoon ground coriander","1/4 teaspoon ground cayenne pepper","2 teaspoons Masaman curry paste","1/3 cup coconut milk","1 teaspoon masaman curry paste","2 tablespoons fish sauce","3 tablespoons tamarind juice","3 tablespoons creamy peanut butter","1.5 tablespoons sugar","1 teaspoon paprika powder","1/2 teaspoons garlic powder","2 cups coconut milk","1/2 cup crushed peanuts"],"instructions":["Slice the chicken breast across grain with at least 1 inch wide each piece. Mix in the Marinade and make sure all pieces are well coated. Marinate the meat for at least 30 minutes in the refrigerator.","Prepare the peanut sauce by adding all the Peanut Sauce ingredients in a 2 quart sauce pan. Mix well and cook on medium heat. Stir the sauce while cooking. Turn off the heat when the sauce is slightly thickened. It takes about 10-15 minutes.","Take out the marinated chicken from the refrigerator. Insert the wooden skewers through the meat lengthwise. Grill the Sate for 4 minutes on each side or until desired tenderness.","Serve with Peanut Sauce and some sliced cucumber."]},
    {"title":"Pork Satay with Sweet Coconut-Milk Glaze Recipe","summary":"Thai pork satay with sweet coconut milk glaze - easy and delicious pork satay marinated with Thai spices and coconut milk | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2014/06/pork_satay_thumb-new-1.jpg","time":"Total Time 35 minutes","ingredients":["6- inch wooden skewers soaked in water for 30 minutes","2 pounds boneless pork shoulder sliced 1/4 inch thick and cut into 4-inch strips","14 ounce coconut milk","2 tablespoons fish sauce","2 tablespoons sugar","1 1/2 teaspoons curry powder","1 teaspoon salt","1 teaspoon ground white pepper","1/3 cup condensed milk"],"instructions":["In a saucepan, combine all the Marinade and whisk over moderate heat until the sugar is dissolved. Pour the marinade into a large bowl and let cool completely.","Mix the pork in the marinade, cover with plastic wrap and refrigerate for 1 hour.","Fire up the grill. Skewer the pork and grill over moderately hight heat, turning until the pork is lightly charred and cooked through. Serve immediately."]},
    {"title":"Tom Yum Recipe","summary":"Tom Yum - the BEST Thai Tom Yum recipe you'll find online. Loaded with shrimp, mushroom, Tom Yum soup is spicy, sour, savory and addictive.","img":"https://rasamalaysia.com/wp-content/uploads/2009/02/tom_yum_thumb.jpg","time":"Total Time 25 minutes","ingredients":["2 1/2 cups shrimp stock best, canned chicken stock, or water","10-12 shrimp or 8 oz head-on and shell-on but chop the eyes part off, devein if you like","3 1/2 tablespoons lime juice","6 bird's eyes chilies pounded","3 big slices galangal","6 kaffir lime leaves bruised","2 tablespoons nam prik pao Thai roasted chili paste","2 tablespoons nam prik pao oil","3 teaspoons fish sauce","1 stalk lemongrass cut into 3-inch strips, pounded with a cleaver","6 canned straw mushrooms / fresh oyster mushrooms / fresh white button mushrooms"],"instructions":["In a pot, bring 3 cups of water to boil. Then add a big handful of shrimp/prawn heads. Boil the shrimp head until the water turns slightly orange in color. Press the shrimp heads with spatula to extract the \"goodies\" from their heads. Let the stock reduce to slightly more than 2 1/2 cups. Drain the shrimp stock and discard the shrimp heads.","Add lemongrass, galangal, kaffir lime leaves, bird's eye chilies, mushrooms, nam prik bao to the shrimp stock and bring it to boil. Add in the shrimp and fish sauce. Lastly, add the lime juice (if you add lime juice too early, the soup might turn bitter). Boil until the shrimps are cooked, dish out and serve hot."]},
    {"title":"Chicken Panang Curry Recipe","summary":"Panang Curry - Thai Panang curry with chicken and green peas. Easy 20-minutes homemade Panang curry recipe that is better than restaurants.","img":"https://rasamalaysia.com/wp-content/uploads/2012/03/panang-curry-thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 skinless & boneless chicken breast cut into small cubes","1 tablespoon oil","2 tablespoons Panang curry paste","1/2 cup coconut milk","1/4 cup water","1 teaspoon sugar","1 tablespoon fish sauce","1/2 cup frozen green peas","4-6 kaffir lime leaves slightly bruised"],"instructions":["Heat up a pot with oil. Add in the Panang curry paste and do a quick stir until aromatic. Add in the chicken meat and blend well with the curry paste, then add in the green peas, coconut milk, kaffir lime leaves, water and the seasonings. Lower the heat to medium and let it simmer for 8-10 minutes. Serve hot with steamed white rice."]},
    {"title":"Thai Basil Chicken Recipe (Gai Pad Krapow)","summary":"Thai Basil Chicken – made with ground chicken, basil leaves, and chilies. Basil chicken is great with rice and this recipe is super easy and authentic.","img":"https://rasamalaysia.com/wp-content/uploads/2014/10/basil_chicken-1.jpg","time":"Total Time 25 minutes","ingredients":["2 tablespoons oil","4 cloves garlic finely chopped","2 shallots finely chopped)","10 oz ground chicken","6 bird's eye chilies chopped and pounded with a mortar and pestle, or 1-2 fresh jalapeno cut into slivers","1 1/4 tablespoons fish sauce","1 teaspoon palm sugar or sugar to taste","1/2 teaspoon kecap manis or sweet soy sauce","1 big bunch Thai basil leaves lower stems removed","3 dashes white pepper"],"instructions":["Add the oil into a heated wok, follow by the chopped garlic and shallots. Stir fry the garlic and shallots until aromatic, then add the ground chicken into the wok. Use the spatula to quickly stir-fry and break the ground chicken meat into small lumps.","When the chicken meat changes color, toss in the chilies, fish sauce, palm sugar, and sweet soy sauce. Stir to combine well. Add in the basil leaves and do a few quick stirs until the basil leaves wilted and you smell the exotic fragrance of the basil leaves. Add the white pepper into the dish, do a final stir, dish out and serve immediately."]},
    {"title":"Thai Peanut Sauce Recipe","summary":"How to make Thai Peanut Sauce - 5 ingredients and you can make the most amazing peanut sauce.","img":"https://rasamalaysia.com/wp-content/uploads/2014/01/thai_peanut_sauce_thumb.jpg","time":"Total Time 15 minutes","ingredients":["1/2 cup creamy peanut butter","3/4 cup coconut milk","2 tablespoons Thai red curry paste","2 tablespoons apple cider vinegar","1 tablespoon sugar or to taste","2 tablespoons ground peanut","Salt to taste","Two 2 chicken thighs, skin-on, boneless","1/2 teaspoon turmeric powder","Salt","Black Pepper"],"instructions":["Add all the ingredients in the saucepan. Use a whisk to quickly whisk all the ingredients together before transferring to a stove top to heat up on low heat. Continue to whisk the peanut sauce until all ingredients are well-combined.","As soon as the peanut sauce starts to simmer and bubble, turn off the heat. (If you like the sauce more watery, you may add a little water to dilute it during the cooking process.) Transfer off the heat and top with some ground peanut. The Thai peanut sauce is now ready. You can keep the left over in the fridge for a week without losing the fresh taste. To make the chicken, marinate both sides of the chicken thighs with turmeric powder, salt and black pepper, for 15 minutes. Pan fry the chicken with some oil until both sides are nicely brown and slightly \"crispy,\" and the meat is cooked through. Slice the chicken into pieces and drizzle with the peanut sauce and garnish with some chopped cilantro leaves. Serve immediately with rice and with fresh salad of your choice."]},
    {"title":"Spicy Chicken with Cashew Nuts Recipe","summary":"Spicy Cashew Chicken – easy and delicious chicken with cashew nuts with just the right amount of heat. Takes 20 mins to make and much better than takeout | rasamalaysia.com","img":"https://rasamalaysia.com/wp-content/uploads/2015/01/spicy-chicken-with-cashew-nuts-thumb.jpg","time":"Total Time 20 minutes","ingredients":["2 tablespoons oil","2 cloves garlic minced","1/2 small onion cut into halves","6-8 finger-length dried red chilies seeded and cut into halves","1/2 cup roasted cashew nuts rinsed and drained","8 oz chicken cut into small cubes","1 scallion trimmed and cut into 1 1/2-in lengths","1 teaspoon regular soy sauce or Maggi seasoning sauce / Golden Mountain sauce","1 tablespoon sweet soy sauce","1 teaspoon fish sauce","1/4 teaspoon sugar or to taste","2 tablespoons water"],"instructions":["Heat up a wok and add the oil. When the oil is heated, add the garlic, onion, dried red chilies and stir-fry until fragrant or when you smell the spicy aroma of the chilies. Add the cashew nuts and follow with the chicken. Stir-fry the chicken until the surface turns opaque. Add all the ingredients for the Sauce into the wok and continue to stir-fry until the chicken is cooked. Stir-in the scallion, dish out and serve immediately with steamed rice."]},
    {"title":"Thai Fish Cake (Tod Mun Pla) Recipe","summary":"Thai Fish Cakes – best and easiest Thai fish cakes recipe or Tod Mun Pla that tastes just like Thai restaurants. So good!","img":"https://rasamalaysia.com/wp-content/uploads/2009/02/thai-fish-cake-tod-mun-pla-recipe-thumb.jpg","time":"Total Time 20 minutes","ingredients":["8 oz fish paste I used store-bought frozen fish paste","1/2 egg beaten","2 tablespoons Thai red curry paste Mae Ploy brand or Maesri brand","5 snake beans or long beans thinly sliced","5 kaffir lime leaves cut into fine thin strips"],"instructions":["In a small bowl, mix all the ingredients above to form a smooth fish paste. Make sure the red curry paste is well blended with the rest of the ingredients.","Heat up a pot of oil. Wet your hands and pick up the fish paste (about the size of a ping pong ball). Use your fingers and palms to flatten it and make it into a patty. Drop it into the cooking oil and fry till golden brown. Repeat the same for the rest of the fish paste. Alternatively, you can prepare all the fish paste first and then deep fry all of them at once.","Serve the fish cakes hot with Thai cucumber salad."]},
    {"title":"Pad Thai Recipe","summary":"Pad Thai - an easy stir-fried noodles dish with rice stick noodles, shrimp, fried tofu, peanuts in Pad Thai sauce made of fish sauce, vinegar, sugar and chili powder. This is a traditional and authentic homemade recipe.","img":"https://rasamalaysia.com/wp-content/uploads/2012/05/pad-thai-thumb-1.jpg","time":"Total Time 20 minutes","ingredients":["4 oz packaged rice noodles","2 tablespoons oil","1 clove garlic finely minced","4 oz medium-sized shrimp shelled and deveined","2 oz fried firm tofu cut into slices","1 large egg","4 –6 oz bean sprouts","1 oz Chinese chives or scallions cut into 2-inch lengths","2 tablespoons crushed peanuts","Lime wedges","1 1/2 tablespoons fish sauce","1 1/2 tablespoons sugar","2 tablespoons water","1 tablespoon rice vinegar","1/2 teaspoon chili powder or more to taste"],"instructions":["Follow the package instructions to boil the dry rice noodles. The rice noodles should be soft (but still chewy and not mushy) after boiling. Rinse the boiled noodles with cold running water.","Mix all the ingredients in the Seasonings in a small bowl until well combined and the sugar completely dissolved, set aside.","Heat up a skillet on high heat and add the oil. As soon as the oil is heated, add the garlic into the skillet and start stirring until you smell the aroma of the garlic. Add the shrimp and the tofu pieces into the skillet and continue stirring. As soon as the shrimp changes color, add the noodles into the skillet and stir continuously, about 30 seconds. Use the spatula to push the noodles to one side of the skillet, and crack the egg on the empty side of the skillet. Use the spatula to break the egg yolk and blend with the egg white, let cook for about 30 seconds. Combine the egg and the noodles, and add the Seasoning sauce. Stir to combine well with the noodles.","Next, add the bean sprouts and chives and continue stirring. As soon as the bean sprouts are cooked, stir-in the crushed peanut. Turn off the heat and serve the Pad Thai immediately with the lime wedges."]},
    {"title":"Thai Green Curry","summary":"","img":"https://rasamalaysia.com/wp-content/uploads/images/thumbs/thai_chicken_green_curry_thumb.jpg","time":"Total Time 20 minutes","ingredients":["1 1/2 tablespoons oil","2 tbsp green curry paste Mae Ploy brand preferred","8  oz chicken breast cut into bite-sized pieces","1/2 cup coconut milk","1/2 cup water","4 oz bamboo shoot","5 kaffir lime leaves lightly bruised","2 red chilies cut into thick strips","1 tbsp fish sauce","1 tbsp sugar or palm sugar (preferred)","1/4 cup Thai basil leaves"],"instructions":["Heat up a pot over medium heat and add the oil. Saute the green curry paste until aromatic, add the chicken and stir to combine well with the curry paste. Add the coconut milk and water and bring it to a quick boil.","Add the bamboo shoots, kaffir lime leaves, and red chilies. Lower the heat to simmer, cover the pot and let simmer for 10 minutes or until the curry slightly thickens.","Add the fish sauce, sugar, and basil leaves. Stir to mix well. Turn off the heat and serve immediately with steamed rice."]}
]